{"id": "01hiAQAACAAJ", "title": "La Sed/The Thirst", "subtitle": "A Harry Hole Novel", "authors": ["Nesbo"], "publisher": "Harry Hole #11", "publishedDate": "2017-06-27", "description": "La esperada nueva novela de Harry Hole, un caso inquietante en el que Jo Nesbo profundiza en la oscuridad del ser humano. Una abogada, especializada en apoyar a victimas de abusos sexuales y violaciones, vuelve a casa tras una decepcionante cita concertada a traves de Tinder. Un psicopata la espera en su dormitorio. Desgarra el cuello de la mujer con una dentadura de hierro. Inmediatamente se filtra a la prensa sensacionalista que en el lugar del crimen falta sangre de la victima y que hay indicios de que el asesino se la ha bebido. Unos dias despues aparece otro cadaver y las circunstancias de su muerte no pueden ser solo una coincidencia... El director de la policia ve amenazadas sus aspiraciones politicas a causa de estos crimenes sin resolver y chantajea a Harry Hole para que acepte investigar el caso. Se inicia entonces una carrera contra reloj para evitar que la matanza continue. Nada es lo que parece y Harry Hole recurre a un psiquiatra especialista en vampirismo para intentar entender la psique del asesino. Resena: El rey indiscutible de la novela negra. El Mundo ENGLISH DESCRIPTION Harry Hole returns in the eleventh installment of the best-selling, electrifying crime fiction series that includes The Bat, The Snowman, and, most recently, Police. In Police--the last novel featuring Jo Nesbo's hard-bitten, maverick Oslo detective--a killer wreaking revenge on the police had Harry Hole fighting for the safety of the people closest to him. Now, in The Thirst, the story continues as Harry is inextricably drawn back into the Oslo police force. A serial murderer has begun targeting Tinder daters--a murderer whose MO reignites Harry's hunt for a nemesis of his past.", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "8416709432"}, {"type": "ISBN_13", "identifier": "9788416709434"}], "pageCount": 480, "printType": ["Paperback", "Hardcover"], "categories": ["Fiction", "Thrillers"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=01hiAQAACAAJ&printsec=frontcover&img=1&zoom=5&source=public", "thumbnail": "http://books.google.com/books/content?id=01hiAQAACAAJ&printsec=frontcover&img=1&zoom=1&source=public"}, "language": "es", "deliveryOption": "normal", "price": 33}