{"id": "0FNQ1LYKTMwC", "title": "The Structure and Dynamics of Networks:", "subtitle": null, "authors": ["Mark Newman", "Albert-László Barabási", "Duncan J. Watts"], "publisher": "Princeton University Press", "publishedDate": "2006-05-07", "description": "From the Internet to networks of friendship, disease transmission, and even terrorism, the concept--and the reality--of networks has come to pervade modern society. But what exactly is a network? What different types of networks are there? Why are they interesting, and what can they tell us? In recent years, scientists from a range of fields--including mathematics, physics, computer science, sociology, and biology--have been pursuing these questions and building a new \"science of networks.\" This book brings together for the first time a set of seminal articles representing research from across these disciplines. It is an ideal sourcebook for the key research in this fast-growing field. The book is organized into four sections, each preceded by an editors' introduction summarizing its contents and general theme. The first section sets the stage by discussing some of the historical antecedents of contemporary research in the area. From there the book moves to the empirical side of the science of networks before turning to the foundational modeling ideas that have been the focus of much subsequent activity. The book closes by taking the reader to the cutting edge of network science--the relationship between network structure and system dynamics. From network robustness to the spread of disease, this section offers a potpourri of topics on this rapidly expanding frontier of the new science.", "industryIdentifiers": [{"type": "ISBN_13", "identifier": "9780691113579"}, {"type": "ISBN_10", "identifier": "0691113572"}], "pageCount": 582, "printType": ["Paperback"], "categories": ["Mathematics", "Internet"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=0FNQ1LYKTMwC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=0FNQ1LYKTMwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "super fast", "price": 46}