{"id": "137AFpdXa84C", "title": "Everyday Forms of State Formation", "subtitle": "Revolution and the Negotiation of Rule in Modern Mexico", "authors": ["Gilbert Michael Joseph", "Daniel Nugent"], "publisher": "Duke University Press", "publishedDate": "1994", "description": "Everyday Forms of State Formation is the first book to systematically examine the relationship between popular cultures and state formation in revolutionary and post-revolutionary Mexico. While most accounts have emphasized either the role of peasants and peasant rebellions or that of state formation in Mexico’s past, these original essays reveal the state’s day-to-day engagement with grassroots society by examining popular cultures and forms of the state simultaneously and in relation to one another. Structured in the form of a dialogue between a distinguished array of Mexicanists and comparative social theorists, this volume boldly reassesses past analyses of the Mexican revolution and suggests new directions for future study. Showcasing a wealth of original archival and ethnographic research, this collection provides a new and deeper understanding of Mexico’s revolutionary experience. It also speaks more broadly to a problem of extraordinary contemporary relevance: the manner in which local societies and self-proclaimed \"revolutionary\" states are articulated historically. The result is a unique collection bridging social history, anthropology, historical sociology, and cultural studies in its formulation of new approaches for rethinking the multifaceted relationship between power, culture, and resistance. Contributors. Ana María Alonso, Armando Bartra, Marjorie Becker, Barry Carr, Philip Corrigan, Romana Falcón, Gilbert M. Joseph, Alan Knight, Florencia E. Mallon, Daniel Nugent, Elsie Rockwell, William Roseberry, Jan Rus, Derek Sayer, James C. Scott", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "0822314673"}, {"type": "ISBN_13", "identifier": "9780822314677"}], "pageCount": 432, "printType": ["Audiobook", "Paperback", "Hardcover"], "categories": ["Political Science", "Politics"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=137AFpdXa84C&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=137AFpdXa84C&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "fast", "price": 28}