{"id": "2FhqAAAAMAAJ", "title": "Percept, Decision, Action", "subtitle": "Bridging the Gaps", "authors": ["Novartis Foundation"], "publisher": "Wiley", "publishedDate": "2006-02-17", "description": "Seemingly simple behaviours turn out, on reflection, to be discouragingly complex. For many years, cognitive operations such as sensation, perception, comparing percepts to stored models (short-term and long-term memory), decision-making and planning of actions were treated by most neuroscientists as separate areas of research. This was not because the neuroscience community believed these operations to act independently—it is intuitive that any common cognitive process seamlessly interweaves these operations—but because too little was known about the individual processes constituting the full behaviour, and experimental paradigms and data collection methods were not sufficiently well developed to put the processes in sequence in any controlled manner. These limitations are now being overcome in the leading cognitive neuroscience laboratories, and this book is a timely summary of the current state of the art. The theme of the book is how the brain uses sensory information to develop and decide upon the appropriate action, and how the brain determines the appropriate action to optimize the collection of new sensory information. It addresses several key questions. How are percepts built up in the cortex and how are judgments of the percept made? In what way does information flow within and between cortical regions, and what is accomplished by successive (and reverberating) stages of processing? How are decisions made about the percept subsequently acted upon, through their conversion to a response according to the learned criterion for action? How does the predicted or expected sensation interact with the actual incoming flow of sensory signals? The chapters and discussions in the book reveal how answering these questions requires an understanding of sensory–motor loops: our perception of the world drives new actions, and the actions undertaken at any moment lead to a new ‘view’ of the world. This book is a fascinating read for all clinical and experimental psychologists and neuroscientists, as well as anyone interested in how we perceive the world and act within it.", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "0470012331"}, {"type": "ISBN_13", "identifier": "9780470012338"}], "pageCount": 314, "printType": ["Hardcover"], "categories": ["Science", "Science"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=2FhqAAAAMAAJ&printsec=frontcover&img=1&zoom=5&source=public", "thumbnail": "http://books.google.com/books/content?id=2FhqAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=public"}, "language": "en", "deliveryOption": "normal", "price": 13}