{"id": "42lSMQAACAAJ", "title": "On the Chase", "subtitle": null, "authors": ["Katie Ruggle"], "publisher": "Sourcebooks Casablanca", "publishedDate": "2017-09-05", "description": "-Vivid and charming.- --CHARLAINE HARRIS, #1 New York Times bestselling author of the Sookie Stackhouse series Injured in the line of duty, His orders are simple: Stay alive. But when a frightened woman bursts into his life, Hugh and his K9 companion have no choice but to risk everything to keep her safe. The sole witness to a horrific crime, Kaylee Ramay flees to the Colorado Rockies to start a new life. There she becomes Grace, a dog kennel employee desperately trying to avoid attention--especially from dangerously attractive K9 Officer Hugh Murdoch. Because Hugh is tall, dark...and nothing but trouble. Hugh is anxious to get back in the field after an act of heroism left him warming the bench. Until then, he and his K9 partner Lexi spend their hours teasing the town's mysterious newcomer. But when their simmering attraction is nearly cut short by a sniper's bullet, Hugh's mystery woman must come clean about the secrets she keeps... Or both of them will pay the price. Rocky Mountain K-9 Unit: Run to Ground (Book 1) On the Chase (Book 2) Survive the Night (Book 3) What People Are Saying: -I love Ruggle's characters. They're sharply drawn, and vividly alive. I'm happy when they find each other. These are wonderful escapist books.---CHARLAINE HARRIS, #1 New York Times Bestselling author of the Sookie Stackhouse series -Sexy and suspenseful, I couldn't turn the pages fast enough.---JULIE ANN WALKER, New York Times and USA Today Bestselling Author for Hold Your Breath -Chills and thrills and a sexy slow-burning romance from a terrific new voice.---D.D. AYRES, author of the K-9 Rescue Series for Hold Your Breath", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "1492643076"}, {"type": "ISBN_13", "identifier": "9781492643074"}], "pageCount": 416, "printType": ["Audiobook", "Paperback"], "categories": ["Fiction", "Romance"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=42lSMQAACAAJ&printsec=frontcover&img=1&zoom=5&source=public", "thumbnail": "http://books.google.com/books/content?id=42lSMQAACAAJ&printsec=frontcover&img=1&zoom=1&source=public"}, "language": "en", "deliveryOption": "fast", "price": 44}