{"id": "4bzgLh_z7YcC", "title": "Doctors and the State", "subtitle": "The Politics of Health Care in France and the United States", "authors": ["David Wilsford"], "publisher": "Duke University Press", "publishedDate": "1991", "description": "All advanced health care systems face severe difficulties in financing the delivery of today's sophisticated medical care. In this study David Wilsford compares the health systems in France and the United States to demonstrate that some political systems are considerably more effective at controlling the cost of care than others. He argues that two variables--the autonomy of the state and the strength and cohesiveness of organized medicine--explain this variance. In France, Wilsford shows, the state is strong in the health policy domain, while organized medicine is weak and divided. Consequently, physicians exercise little influence over health care policymaking. By contrast, in the United States the state is weak, the employers and insurers who pay for health care are fragmented, and organized medicine is strong and well financed. As a result, medical professionals are able to exert a greater influence on policymaking, thus making cost control more difficult. Wilsford extends his comparison to health care systems in the United Kingdom, West Germany, Italy, Canada, and Japan. Whether the private or public sector finances health care, he discovers, there is now an important trend in all of the advanced industrial countries toward controlling escalating costs by curbing both the medical profession's clinical autonomy and physicians' incomes.", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "0822310929"}, {"type": "ISBN_13", "identifier": "9780822310921"}], "pageCount": 355, "printType": ["Paperback"], "categories": ["Medical", "Politics"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=4bzgLh_z7YcC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=4bzgLh_z7YcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "normal", "price": 23}