{"id": "4SpUjwEACAAJ", "title": "Murder Most Unladylike", "subtitle": null, "authors": ["Robin Stevens"], "publisher": "Puffin Books", "publishedDate": "2016-03-24", "description": "When Daisy Wells and Hazel Wong set up their very own secret detective agency at Deepdean School for Girls, they struggle to find any truly exciting mysteries to investigate. (Unless you count the case of Lavinia's missing tie. Which they don't.) Then Hazel discovers the Science Mistress, Miss Bell, lying dead in the Gym. She assumes it was a terrible accident - but when she and Daisy return five minutes later, the body has disappeared. Now Hazel and Daisy not only have a murder to solve: they have to prove one happened in the first place. Determined to get to the bottom of the crime before the killer strikes again (and before the police can get there first, naturally), Hazel and Daisy must hunt for evidence, spy on their suspects and use all the cunning and intuition they can muster. But will they succeed? And can their friendship stand the test? 'Ripping good fun' The Times 'A skilful blend of golden era crime novel and boarding school romp . . . The novel works both as an affectionate satire and an effective murder mystery, and Stevens can go places Enid Blyton never dreamt of . . . Top class' Financial Times 'Plotting is what sets this book apart; this is about who was where at the time of the murder, and it's about finding the chink in the alibi' Telegraph", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "0141369760"}, {"type": "ISBN_13", "identifier": "9780141369761"}], "pageCount": 352, "printType": ["Hardcover"], "categories": ["Children's stories", "Mystery"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=4SpUjwEACAAJ&printsec=frontcover&img=1&zoom=5&source=public", "thumbnail": "http://books.google.com/books/content?id=4SpUjwEACAAJ&printsec=frontcover&img=1&zoom=1&source=public"}, "language": "en", "deliveryOption": "super fast", "price": 6}