{"id": "_emGQR8rUokC", "title": "Created Equal", "subtitle": null, "authors": ["R. A. Brown"], "publisher": "Tate Publishing", "publishedDate": "2011-06", "description": "Desperate to become a priest in the Catholic Church, Aleksandra Kowalski turns to Thomas Patrick O'Reilly, one of the wealthiest and most successful trial lawyers in Houston, Texas. Tommy believes the Catholic Church has no basis under United States law to exclude women from the seminary and files suit against the Archdiocese of Galveston-Houston and Archbishop Jorge Sierra for sex discrimination without justifiable cause. The Catholic Church hires Monsignor Enrico Renzulli, the General Counsel of the United States Catholic Conference of Bishops. Renzulli, a priest and Harvard-educated attorney, has substantial trial experience and has taken on and beaten lawyers considerably smarter than O'Reilly. He believes the lawsuit should be summarily dismissed because the First Amendment of the United States Constitution grants all citizens the freedom of religion, and it prevents a federal court from interfering with the ecclesiastical rules of any church, including the Catholic Church. But watching and waiting in the wings is an extreme and tyrannical sect unaffiliated with the Catholic Church. As the trial unfolds and the legal proceedings begin to undermine the sacred Catholic Church teaching, a right-wing extremist and a member of the Holy Mother Church concocts a plot to stop the heresy against God that includes kidnapping and murder. Will the First Amendment protect the Catholic Church and supersede all? Will Tommy O'Reilly come through? Will Aleksandra Kowalski survive this ordeal? Find out in R.A. Brown's gripping legal thriller,Created Equal.", "industryIdentifiers": [{"type": "ISBN_13", "identifier": "9781617776403"}, {"type": "ISBN_10", "identifier": "1617776408"}], "pageCount": 236, "printType": ["Paperback", "Hardcover"], "categories": ["Fiction", "Mystery"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=_emGQR8rUokC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=_emGQR8rUokC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "super fast", "price": 27}