{"id": "aakY96H1_GgC", "title": "Global Games", "subtitle": null, "authors": ["Maarten Van Bottenburg"], "publisher": "University of Illinois Press", "publishedDate": "2001", "description": "Why is soccer the sport of choice in South America, while baseball has soared to popularity in the Caribbean? How did cricket become India's national sport, while China is a stronghold of table tennis?In Global Games Maarten Van Bottenburg asserts that it is the \"hidden competition\" of social and international relations, rather than the particular qualities of a given sport, that explains who plays what sport and why. People's different and changing preferences for sports are based on the social and cultural meanings they attribute to each sport, meanings that alter in response to changing relations among groups of people, both social classes and nations. Looking at Britain, Germany, the United States, and Japan - the four centers from which the sports practiced by most people worldwide originate - Van Bottenburg discusses how individual sports developed, what institutions and groups spread them, and why certain sports and not others found a ready audience elsewhere. The nature of the relationship between the country of origin and the adopting country, as well as the international status of each, help determine how successfully a particular sport takes hold and to what degree it is modified by its new practitioners. Other key factors include which groups dominated and promoted the various sports in their countries of origin, which groups appropriated them elsewhere, and the latter's positions within their society's class structure.A detailed and coherent account of the social significance and the politics underlying sports, Global Games demonstrates that sports are not a trivial pursuit but are deeply embedded in the way individuals and nations wish to be perceived.", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "0252026543"}, {"type": "ISBN_13", "identifier": "9780252026546"}], "pageCount": 282, "printType": ["Audiobook", "Paperback"], "categories": ["Social Science", "Sports"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=aakY96H1_GgC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=aakY96H1_GgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "super fast", "price": 16}