{"id": "aEDAix3XTokC", "title": "MANUAL DE LA ORGANIZACIÓN INSTITUCIONAL DEL DEPORTE", "subtitle": null, "authors": ["Eduardo Blanco"], "publisher": "Editorial Paidotribo", "publishedDate": "2006-05-05", "description": "Actualmente no es concebible una formación completa en el ámbito de las ciencias de la actividad física y del deporte sin tener en cuenta el marco organizativo en que se desarrollan este conjunto de actividades. Este libro. es un manual pensado para los estudiantes de los diversos cursos y estudios que guardan relación con la actividad física y el deporte. También puede ser de gran utilidad para los profesionales de la gestión deportiva en el seno de los clubes, de las federaciones y de las distintas administraciones públicas. Este libro es una herramienta ágil y accesible para todos los profesionales del deporte con el fin de que puedan comprender y analizar el entorno organizativo en que se desarrolla su actividad profesional. Para ello, el Manual abarca desde el deporte para todos al deporte profesional, pasando por el deporte escolar y las actividades lúdico-deportivas; desde las instituciones públicas a los entes privados del deporte; desde el contexto internacional hasta el ámbito local, pasando por el nivel estatal y autonómico; desde la visión del gestor hasta la visión del educador o la del practicante, recogiendo las diferentes manifestaciones de la organización deportiva, lo que permite obtener una visión global de la estructura organizativa actual. Asimismo, reúne todo el conjunto de aspectos normativos que deben conocerse.", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "848019457X"}, {"type": "ISBN_13", "identifier": "9788480194570"}], "pageCount": 376, "printType": ["Paperback", "Hardcover"], "categories": ["Sports & Recreation", "Sports"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=aEDAix3XTokC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=aEDAix3XTokC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "es", "deliveryOption": "super fast", "price": 31}