{"id": "aH6colCSUNsC", "title": "Designing Wide Area Networks and Internetworks", "subtitle": "A Practical Guide", "authors": ["J. Scott Marcus"], "publisher": "Addison-Wesley Professional", "publishedDate": "1999", "description": "Speedy, reliable, and secure communications are essential for maintaining an organizationis competitiveness, and Wide Area Networks and Internetworks are quickly proliferating in order to meet this need. Building such a network, however, can be a daunting task; a large investment is required, and organizations must navigate through a dizzying array of technological and design options. /P> Designing Wide Area Networks and Internetworks clarifies this complex task by outlining a top-down, step-by-step process for constructing a WAN or internetwork that is effective for your organization. This book will guide you through the steps of determining requirements, designing the network structure, choosing appropriate technologies, and evaluating results. The authoris practical approach distills exactly what you need to know about networking theory and technological background in order to accomplish a given task. On the financial side, it is important to note that the difference between a good design and a poor one can represent many millions of dollars per year. This book presents a quantitative, business-oriented approach to network design. It focuses on the economic and performance characteristics of various network technologies and carrier service options, and explains the conditions for which each is optimal.", "industryIdentifiers": [{"type": "ISBN_13", "identifier": "9780201695847"}, {"type": "ISBN_10", "identifier": "0201695847"}], "pageCount": 385, "printType": ["Audiobook", "Paperback"], "categories": ["Computers", "Internet"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=aH6colCSUNsC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=aH6colCSUNsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "fast", "price": 43}