{"id": "ak0nDwAAQBAJ", "title": "Beijing Smog", "subtitle": "", "authors": ["Ian Williams"], "publisher": "Troubador Publishing Ltd", "publishedDate": "2017-06-20", "description": "Set in contemporary China, Beijing Smog is a novel about deception. It is about the power of online ridicule and rumour in a society where truth and reality are about as clear as the thick smog, beneath which corrupt politicians struggle for power, spies stalk cyberspace, and a bubble economy is about to burst. It is the story of an image, which is posted online as a joke, goes viral, and ends up threatening the ruling Communist Party, which doesn’t have a sense of humour. It is built around three characters. A 21-year-old Chinese blogger who lives mostly in a virtual world beyond the screen of his smartphone, and who first posts the image; a delusional British businessman, still selling the China Miracle even as it crumbles around him, and an American diplomat chasing cyber spies. Their individual stories collide as the image takes on a life of its own in a bizarre and threatening way for them all – but mostly for the Party. Ian Williams’ cyber thriller takes readers from Beijing’s smoggy streets to Shanghai’s historic Bund, from the casinos of Macau to the grim factories of southern China, the ice sculptures of freezing Harbin and the islands off the coast of Hong Kong. Beijing Smog is a gripping, character-led novel that takes a satirical look at the topsy-turvy world that is modern China. An edgy and original approach, this novel intelligently captures the madness, but also the corruption and dangers of the People’s Republic and sheds light on the Westerners who have grown rich by looking the other way. Perfect for fans of classic, fast-moving thrillers, Beijing Smog will also appeal to those with an interest in eastern politics, economics and culture. Ian Williams has lived in and reported from Asia for more than 20 years, travelling the length and breadth of China. He draws on that experience to provide an authentic and realistic account of a nation consistently shrouded in secrecy.", "industryIdentifiers": [{"type": "ISBN_13", "identifier": "9781788037372"}, {"type": "ISBN_10", "identifier": "1788037375"}], "pageCount": 384, "printType": ["Audiobook", "Hardcover"], "categories": ["Thrillers"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=ak0nDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=ak0nDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "fast", "price": 22}