{"id": "B4OfAwAAQBAJ", "title": "Bear Grylls: Two All-Action Adventures", "subtitle": "Facing Up - Facing the Frozen Ocean", "authors": ["Bear Grylls"], "publisher": "Pan Macmillan", "publishedDate": "2012", "description": "A collection combining two of Bear Grylls' most exciting adventures – Facing Up and Facing the Frozen Ocean.At extreme altitude youth holds no advantage over experience, and it is generally acknowledged that younger climbers have more difficulty coping with the adverse effects of mountaineering. Nevertheless, only two years after breaking his back in a free-fall parachuting accident, Bear Grylls overcame severe weather conditions, fatigue, dehydration and a last minute illness to stand on top of the world's highest mountain. Facing Up is the story of his adventure, his courage and humour, his friendship and faith.It started out as a carefully calculated attempt to complete the first unassisted crossing of the frozen north Atlantic in a rigid inflatable boat. It became a terrifying battle against storm-force winds, crashing waves and icebergs as large as cathedrals. Starting from the remote north Canadian coastline, Grylls and his crew crossed the infamous Labrador Sea, pushed on through ice-strewn waters to Greenland and then found themselves isolated in a perfect storm 400 miles from Iceland. Compelling, vivid and inspirational, Facing the Frozen Ocean will appeal to Bear Grylls many readers and win him many more.", "industryIdentifiers": [{"type": "ISBN_13", "identifier": "9780230761520"}, {"type": "ISBN_10", "identifier": "0230761526"}], "pageCount": 640, "printType": ["Hardcover"], "categories": ["Biography & Autobiography", "Adventure"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=B4OfAwAAQBAJ&printsec=frontcover&img=1&zoom=5&source=public", "thumbnail": "http://books.google.com/books/content?id=B4OfAwAAQBAJ&printsec=frontcover&img=1&zoom=1&source=public"}, "language": "en", "deliveryOption": "normal", "price": 39}