{"id": "bIMyAAAACAAJ", "title": "Ring", "subtitle": null, "authors": ["Kōji Suzuki"], "publisher": null, "publishedDate": "2004", "description": "Stunning, cutting-edge thriller with a chilling supernatural twist from Japan's stylish new literary star. Asakawa is a hardworking journalist who has climbed his way up from local-news beat reporter to writer for his newspaper's weekly magazine. A chronic workaholic, he doesn't take much notice when his seventeen-year-old niece dies suddenly -- until a chance conversation reveals that another healthy teenager died at exactly the same time, in chillingly similar circumstances. Sensing a story, Asakawa begins to investigate, and soon discovers that this strange simultaneous sudden-death syndrome also affected another two teenagers. Exactly one week before their mysterious deaths the four teenagers all spent the night at a leisure resort in the same log cabin. When Asakawa visits the resort, the mystery only deepens. particular videotape. When he watches it, instead of a movie he finds an odd collection of disparate images with a portentous message at the end: Those who have viewed these images are fated to die at this exact hour one week from now. Asakawa finds himself in a race against time -- he has only seven days to find the cause of the teenagers' deaths before it finds him. The hunt puts him on the trail of an apocalyptic power that will force Asakawa to choose between saving his family and saving civilization.", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "0007178840"}, {"type": "ISBN_13", "identifier": "9780007178841"}], "pageCount": 284, "printType": ["Paperback", "Hardcover"], "categories": ["Detective and mystery stories", "Horror"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=bIMyAAAACAAJ&printsec=frontcover&img=1&zoom=5&source=public", "thumbnail": "http://books.google.com/books/content?id=bIMyAAAACAAJ&printsec=frontcover&img=1&zoom=1&source=public"}, "language": "en", "deliveryOption": "fast", "price": 47}