{"id": "bKFGrjtnUvkC", "title": "The Politics of Vaccination", "subtitle": "Practice and Policy in England, Wales, Ireland, and Scotland, 1800-1874", "authors": ["Deborah Brunton"], "publisher": "University Rochester Press", "publishedDate": "2008", "description": "The introduction of public vaccination was among the greatest of public health triumphs. By the end of the nineteenth century, legislation framed and implemented by medical experts in Britain's government brought smallpox under control for the first time. The Politics of Vaccination: Practice and Policy in England, Wales, Ireland, and Scotland, 1800-1874, by historian Deborah Brunton, reveals the conflict that accompanied this success, and highlights how power differentials among government officials, medical experts, and general practitioners influenced vaccination policy across Great Britain. Brunton challenges the assumption that expert supervision was crucial, showing instead that local organization was pivotal to successful public vaccination. Throughout Britain, ordinary practitioners -- eager to enhance their professional status -- demanded the right to shape and supervise public vaccination. But their achievement depended on wider political considerations, and varied from country to country. In England and Wales, for instance, practitioners were defeated by a new band of medical experts who had established a power base within government. In Scotland, medical professionals contrived to keep most vaccination within the private sector, but local enthusiasm ensured very high levels of participation. Public vaccination was most successful in Ireland, where practitioners had limited influence over dispensary provision and smallpox was nearly eradicated, if briefly, in the 1860s. In The Politics of Vaccination, Brunton demonstrates that public vaccination was not simply a medical matter: it was a divisive political issue, with outcomes strongly influenced by competing partisan interests. Deborah Brunton is senior lecturer in History of Medicine at the Open University.", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "1580460364"}, {"type": "ISBN_13", "identifier": "9781580460361"}], "pageCount": 255, "printType": ["Audiobook", "Hardcover"], "categories": ["History", "Politics"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=bKFGrjtnUvkC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=bKFGrjtnUvkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "super fast", "price": 17}