{"id": "Cedb9BtmXysC", "title": "Impersonations", "subtitle": "Troubling the Person in Law and Culture", "authors": ["Sheryl N. Hamilton"], "publisher": "University of Toronto Press", "publishedDate": "2009", "description": "Personhood is considered at once a sign of legal-political status and of socio-cultural agency, synonymous with the rational individual, subject, or citizen. Yet, in an era of life-extending technologies, genetic engineering, corporate social responsibility, and smart technology, the definition of the person is neither benign nor uncontested. Boundaries that previously worked to secure our place in the social order are blurring as never before. What does it mean, then, to be a person in the twenty-first century? In Impersonations, Sheryl N. Hamilton uses five different kinds of persons - corporations, women, clones, computers, and celebrities - to discuss the instability of the concept of personhood and to examine some of the ways in which broader social anxieties are expressed in these case studies. She suggests that our investment in personhood is greater now than it has been for years, and that our ongoing struggle to define the term is evident in law and popular culture. Using a cultural studies of law approach, the author examines important issues such as whether the person is a gender-neutral concept based on individual rights, the relationship between personhood and the body, and whether persons can be property. Impersonations is a highly original study that brings together legal, philosophical, and cultural expressions of personhood to enliven current debates about our place in the world.", "industryIdentifiers": [{"type": "ISBN_13", "identifier": "9780802098467"}, {"type": "ISBN_10", "identifier": "0802098460"}], "pageCount": 290, "printType": ["Paperback"], "categories": ["Law", "Technology"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=Cedb9BtmXysC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=Cedb9BtmXysC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "normal", "price": 39}