{"id": "cHe1f5IDDnQC", "title": "The Politics of Internet Communication", "subtitle": null, "authors": ["Robert J. Klotz"], "publisher": "Rowman & Littlefield", "publishedDate": "2004", "description": "This concise book explores the wide range of topics at the intersection of politics and the Internet. Recognizing the changes in the Internet over time, Klotz provides an innovative analysis of online access, activities, advocacy, government, journalism, and social capital. The politics of the Internet is considered along with politics on the Internet. A highlight is the in-depth discussion of cyberlaw that provides an accessible framework for understanding the legal treatment of key issues such as music file-sharing, privacy, terrorism, spam, pornography, and domain names. Examples from the 2002 midterm elections and the early 2004 campaign fundraising success of Howard Dean add currency to the debate about the impact of the Internet on democratic politcs. The author conveys the vitality and humor of Internet politics in a way that readers will enjoy. From impassioned debate about imaginary legislation to the animal rights group PETA's lawsuit taking peta.org from 'People Eating Tasty Animals, ' Klotz brings the colorful history of the Internet to life. Written from an interdisciplinary perspective, the book is infused with original longitudinal data, examples, online resources and landmark events that reveal how the Internet is enriching both public and private life.", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "0742529266"}, {"type": "ISBN_13", "identifier": "9780742529267"}], "pageCount": 259, "printType": ["Paperback"], "categories": ["Computers", "Internet"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=cHe1f5IDDnQC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=cHe1f5IDDnQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "fast", "price": 29}