{"id": "CLAdIIUbi3QC", "title": "Reparación de televisión", "subtitle": "mediciones y métodos de localización de averías dedicados al taller de reparaciones", "authors": ["Heinz Lummer"], "publisher": "Marcombo", "publishedDate": "1997", "description": "A partir de la experiencia del autor durante muchos años en la reparación de televisores, éste ha desarrollado y mejorado en cada edición este método de trabajo para el análisis y reparación de averías en la televisión. Es una valiosa herramienta práctica para los técnicos reparadores. En cada capítulo encontrará una breve base teórica y enseguida un análisis del funcionamiento, posibles averías, una serie de mediciones y su solución. Con 274 figuras (esquemas, oscilogramas, fotografías de pantalla) y 88 ilustraciones a todo color de la representación en pantalla. Índice resumido del libro; - El servicio técnico de TV en el transcurso del tiempo -Localización de averias - El preamplificador de infrarrojos - La selección de programas - El sistema de control de las funciones analógicas - La unidad de búsqueda de emisoras con memorización de los números asignados a los programas - El sintonizador - La amplificación de f.i., en la demodulación y en el CAG - Los amplificadores de video de los televisores en blanco y negro - Los amplificadores de luminancia - Los tubos de imagen para blanco y negro - Tubos de imagen para TV en color - El separador de sincronismo y en la sincronización de línea - Los osciladores de línea - Las etapas finales de línea - El circuito de alta tensión - La corrección este-oeste - La corrección norte-sur - La sincronización de cuadro, en los osciladores de cuadro y en las etapas finales de cuadro - La selección de audio - La selección de croma - El amplificador de crominancia - El decodificador PAL - Los demoduladores sincrónicos - La matriz en las etapas finales - El amplificador de la señal de sincronismo de color - El supresor de color - El oscilador de la subportadora de color - El sistema de inversión PAL - Fuentes de alimentación conmutadas - Receptores de televisión digitales - Los decodificadores de teletexto - Equipos de recepción vía satélite.", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "8426711227"}, {"type": "ISBN_13", "identifier": "9788426711229"}], "pageCount": 388, "printType": ["Audiobook", "Paperback", "Hardcover"], "categories": ["Technology", "Technology"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=CLAdIIUbi3QC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=CLAdIIUbi3QC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "es", "deliveryOption": "super fast", "price": 18}