{"id": "dSsyAGwEY1kC", "title": "Sport, Representation and Evolving Identities in Europe", "subtitle": null, "authors": ["Philip Dine", "Seán Crosson"], "publisher": "Peter Lang", "publishedDate": "2010", "description": "Sport annually mobilizes millions of people across Europe: as practitioners in a wide variety of competitive, educational, or recreational contexts, and as spectators, who are physically present or following events through the mass media. This book presents original research into modern sport funded by the Irish Research Council for the Humanities and Social Sciences. Its aim is to examine the distinctive contribution made by this complex phenomenon to the construction of European identities. Attention is focused on sport's social significance, as a set of mass-mediated practices and spectacles giving rise to a network of images, symbols, and discourses. The book seeks to explore, and ultimately to explain, the processes of representation and mediation involved in the sporting construction, and subsequent renegotiation, of local, national, and, increasingly, global identities. It offers a survey of key developments in sporting Europe - from the mid-nineteenth century to the present, and from the Atlantic to the Urals - presenting findings by acknowledged international experts and emerging scholars at the level of individuals, communities, regions, nation-states, and Europe as a whole, in both its geographical and political incarnations. Its focus on representation offers a broadly conceived, and consciously inclusive, approach to issues of 'Europeanness' in modern and contemporary sport.", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "303911977X"}, {"type": "ISBN_13", "identifier": "9783039119776"}], "pageCount": 369, "printType": ["Audiobook", "Hardcover"], "categories": ["Social Science", "Sports"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=dSsyAGwEY1kC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=dSsyAGwEY1kC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "normal", "price": 50}