{"id": "edpvjgEACAAJ", "title": "El asesinato de Cenicienta", "subtitle": null, "authors": ["Mary Higgins Clark"], "publisher": "Debolsillo", "publishedDate": "2015-11-02", "description": "Un thriller contemporáneo sobre un reality de televisión que trata de desvelar los misterios de un caso de asesinato sin resolver que conmocionó al mundo en los años noventa. La productora de televisión Laurie Moran no podría estar más contenta. El episodio piloto de Bajo sospecha ha sido un éxito. Se trata de un reality en el que se examinan casos sin resolver para tratar de desentrañar la verdad. Ahora Laurie tiene en mente un caso perfecto: el «asesinato de Cenicienta», que en los años noventa conmocionó al mundo. La muerte de Susan Dempsey, una estudiante de la Universidad de California de Los Ángeles, guapa y con mucho talento, suscitó un sinfín de preguntas: ¿Por qué el coche estaba aparcado tan lejos de donde se halló el cadáver? ¿Llegó a presentarse al casting en casa de un prometedor director, Frank Parker? ¿Qué vínculo tenía con una controvertida iglesia del campus? ¿Por qué le faltaba un zapato? Laurie sabe que este programa puede ser un bombazo, sobre todo porque los sospechosos son ricos magnates de la tecnología o forman parte de la élite de Hollywood. Parece una historia para la gran pantalla ¿pero está listo el asesino de Cenicienta para su primer plano? ENGLISH DESCRIPTION In this collaboration between \"Queen of Suspense” Mary Higgins Clark and bestselling author Alafair Burke, \"the snappy pace, layered characters, and many plot surprises will keep readers guessing in this fascinating mystery” (Booklist). Television producer Laurie Moran is delighted when the pilot for her reality drama, Under Suspicion, is a success. Even more, the program--a cold case series that revisits unsolved crimes by recreating them with those affected--is off to a fantastic start when it helps solve an infamous murder in the very first episode. Now Laurie has the ideal case to feature in the next episode of Under Suspicion: the Cinderella Murder. When Susan Dempsey, a beautiful and multi-talented UCLA student, was found dead, her murder raised numerous questions. Why was her car parked miles from her body? Had she ever shown up for the acting audition she was due to attend at the home of an up-and-coming director? Why does Susan’s boyfriend want to avoid questions about their relationship? Was her disappearance connected to a controversial church? Was she close to her computer science professor because of her technological brilliance, or something more? And why was Susan missing one of her shoes when her body was discovered? With the help of Under Suspicion host Alex Buckley, Laurie knows the case will attract great ratings, especially when the former suspects include Hollywood’s elite and tech billionaires. The suspense and drama are perfect for the silver screen--but is Cinderella’s murderer ready for a close-up? Together Mary Higgins Clark and Alafair Burke deliver \"plenty of intrigue and excitement” (Publishers Weekly) in this exciting start to a new series that will keep you guessing until the final page.", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "8490627762"}, {"type": "ISBN_13", "identifier": "9788490627761"}], "pageCount": 336, "printType": ["Audiobook", "Paperback"], "categories": ["Thrillers"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=edpvjgEACAAJ&printsec=frontcover&img=1&zoom=5&source=public", "thumbnail": "http://books.google.com/books/content?id=edpvjgEACAAJ&printsec=frontcover&img=1&zoom=1&source=public"}, "language": "es", "deliveryOption": "fast", "price": 29}