{"id": "fcHTVvjZ1lgC", "title": "Practical Philosophy of Sport and Physical Activity", "subtitle": null, "authors": ["Robert Scott Kretchmar"], "publisher": "Human Kinetics", "publishedDate": "2005", "description": "Philosophy is a crucial, yet often overlooked, part of kinesiology students' education. Practical Philosophy of Sport and Physical Activity, Second Edition,provides students with a thorough, clear, and practical introduction to the philosophy of physical activity and sport, and in doing so, prepares them for the ethical questions they will face as professionals. This second edition has been significantly revised, and it has been enhanced to include the following features: -Expanded instruction on practical ethics in physical activity, guiding students in how to rank values and turn those values into actions -New material that emphasizes physical activity as well as sport, and provides specific holistic techniques for the practitioner in the workplace -In-depth case studies along with discussion questions that can be used to teach students how to follow a philosophical argument and come to their own conclusions The case studies, one on running up the score and the other on performance-enhancing substances, are based on two articles that are reprinted in their entirety in the appendix. Practical Philosophy of Sport and Physical Activity, Second Edition,helps students examine key moral questions in sport. Its approach to the content helps students follow and dissect ethical arguments, think through philosophic issues, and apply theory to practice. Each chapter includes objectives, philosophical exercises, reviews, and study questions to reinforce understanding. Kretchmar's engaging writing style accentuates important topics of discussion, focusing the readers' attention on the philosophy behind the practice or strategy. As a result, students develop their philosophical skills, refine their personal philosophy concerning physical activity and sport, and learn that philosophy can be clear, practical, and holistic, rather than obscure, overly theoretical, and dualistic. The text is arranged in four parts. Part Iintroduces students to the nature and methods of philosophy. Part IIfocuses on issues relating to the nature of the athlete or client and includes analyses of dualism, scientific materialism, and holism. Part IIIdelves into kinesiology issues, including the nature of play, games, and competition, and Part IVprovides expanded material on ethics, value choices, and active lifestyles. This text provides students with the practical tools and specific techniques they need to think ethically and systematically, as they become skilled practitioners in the field of physical activity and sport. In doing so, it demystifies philosophy and reveals it as the guiding element in our understanding of, and approach to, activity, games, and competitions.", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "0736001417"}, {"type": "ISBN_13", "identifier": "9780736001410"}], "pageCount": 303, "printType": ["Audiobook"], "categories": ["Education", "Sports"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=fcHTVvjZ1lgC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=fcHTVvjZ1lgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "fast", "price": 8}