{"id": "fr2hkPLwIUYC", "title": "The Book of Lights I", "subtitle": "Unveiling the Mystery of God", "authors": ["John A. Parry"], "publisher": "P & P Pub", "publishedDate": "2005-01-01", "description": "The Book of Lights Unveiling the Mystery of God opens the portal to life's deepest and previously undiclosed spiritual secrets. It challenges the mind to share in the knowledge that only mystics, adepts, and wise men have attained throughout the Ages. This treasure-trove of hidden knowledge takes the reader step by step into the World of the Infinite. Although the Bible is utilized to provide a base for conveying this revelatory knowledge, The Book of Lights Unveiling the Mystery of God is not secular. Clerics of all persuasions will find its presentations invaluable in their ministries. It is a work that personalizes the Bible's content and provides the reader with the Creator's eternal truths. By spiritually joining the mind to the Word on Scripture's printed page, the reader obtains the intangible understanding that the author desired to convey. The Book of Lights Unveiling the Mystery of God is a work that opens the mind to those truths the reader has longed to understand and will forever cherish. Bible study groups will find their understanding of Scripture's Word progressively enhanced when they correlate the translations offered herein with the words of Jesus, Moses and all the prophets. Those who quietly spend time reflecting upon the translations of this book will find a source of peace and spiritual inspiration unlike any they have ever known. The Book of Lights is, indeed, the \"Book of Life\", and all who identify with its revelations shall find their name written therein. Book jacket.", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "0974574007"}, {"type": "ISBN_13", "identifier": "9780974574004"}], "pageCount": 192, "printType": ["Audiobook", "Paperback"], "categories": ["Religion", "Mystery"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=fr2hkPLwIUYC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=fr2hkPLwIUYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "super fast", "price": 43}