{"id": "GAYgDWC4pyEC", "title": "The Forgotten Founders", "subtitle": "Rethinking The History Of The Old West", "authors": ["Stewart L. Udall"], "publisher": "Island Press", "publishedDate": "2012-06-30", "description": "\"àan impressive new bookà [The Forgotten Founders] is a gem that encompasses virtually every aspect of the development of our region.\" -ROCKY MOUNTAIN NEWS \"[Udall] offers a convincing argument that it wasn't the cavalry, fur traders, prospectors, gunslingers or railroad builders who tamed the West; it was 'courageous men and women who made treks into wilderness and created communities in virgin valleys.' Udall's spare prose adds impact to his words.\" -THE SEATTLE TIMES \"The West is so cluttered with misconceptions that it is hard to have a serious discussion about its history.\" --Wallace Stegner. For most Americans, the \"Wild West\" popularized in movies and pulp novels -- a land of intrepid traders and explorers, warlike natives, and trigger-happy gunslingers -- has become the true history of the region. The story of the West's development is a singular chapter of history, but not, according to former Secretary of the Interior and native westerner Stewart L. Udall, for the reasons filmmakers and novelists would have us believe. In The Forgotten Founders, Stewart Udall draws on his vast knowledge of and experience in the American West to make a compelling case that the key players in western settlement were the sturdy families who travelled great distances across forbidding terrain to establish communities there. He offers an illuminating and wide-ranging overview of western history and those who have written about it, challenging conventional wisdom on subjects ranging from Manifest Destiny to the importance of Eastern capitalists to the role of religion in westward settlement. Stewart Udall argues that the overblown and ahistorical emphasis on a \"wild west\" has warped our sense of the past. For the mythical Wild West, Stewart Udall substitutes a compelling description of an Old West, the West before the arrival of the railroads, which was the home place for those he calls the \"wagon people,\" the men and women who came, camped, settled, and stayed. He offers a portrait of the West not as a government creation or a corporate colony or a Hollywood set for feckless gold seekers and gun fighters but as primarily a land where brave and hardy people came to make a new life with their families. From Native Americans to Franciscan friars to Mormon pioneers, these were the true settlers, whose goals, according to Stewart Udall were \"amity not conquest; stability, not strife; conservation, not waste; restraint, not aggression.\" The Forgotten Founders offers a provocative new look at one of the most important chapters of American history, rescuing the Old West and its pioneers from the margins of history where latter-day mythmakers have dumped them. For anyone interested in the authentic history of the American West, it is an important and exciting new work.", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "1610910702"}, {"type": "ISBN_13", "identifier": "9781610910705"}], "pageCount": 208, "printType": ["Audiobook", "Paperback"], "categories": ["History", "History"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=GAYgDWC4pyEC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=GAYgDWC4pyEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "normal", "price": 30}