{"id": "gz06hpkZYXoC", "title": "Birthright", "subtitle": null, "authors": ["Barry Ahern"], "publisher": "Tate Publishing", "publishedDate": "2011-08", "description": "With the evening's black strangle slowly smothering all that's left in the day, Zachary falls to his knees, holding his head in pain. Oblivious to this first glimpse at life as a Viscent, he curls up in a ball, as the cold surface of the road pushes against his face. With his eyes closed and face clenched, the realization that he has a unique gift brewing inside of him is beyond his wildest dreams. However, to earn this gift, to be a Viscent, he will soon learn that he must blindly travel to three different worlds, overcome the snare of the challenges within, and the darkness that chases him. Zachary must quickly realize his Birthright, or crumble under the curse of his destiny. It is explained to Zach that three Viscents are selected every one hundred years to serve as the guardians of our world, each with their own unique power. But to realize these powers, there is great danger, as they must first all succeed at completing a certain challenge in three similar worlds to our own world, but each world with one big difference. Opposing the young Viscents is an evil force focused on sabotaging their efforts in the hopes of trapping the Viscents in these different worlds forever or destroying them completely. Shocked by the discovery, Zach now has to summon courage he never knew he had to face his opposition, protect those he has grown to love, and finally achieve his Birthright.", "industryIdentifiers": [{"type": "ISBN_13", "identifier": "9781617778100"}, {"type": "ISBN_10", "identifier": "1617778109"}], "pageCount": 276, "printType": ["Audiobook", "Paperback"], "categories": ["Fiction", "Science+Fiction"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=gz06hpkZYXoC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=gz06hpkZYXoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "fast", "price": 14}