{"id": "H2KB2DK4w78C", "title": "Technology and Privacy", "subtitle": "The New Landscape", "authors": ["Philip E. Agre", "Marc Rotenberg"], "publisher": "MIT Press", "publishedDate": "1998", "description": "Privacy is the capacity to negotiate social relationships by controlling access topersonal information. As laws, policies, and technological design increasingly structure people'srelationships with social institutions, individual privacy faces new threats and newopportunities. Over the last several years, the realm of technology and privacyhas been transformed, creating a landscape that is both dangerous and encouraging. Significantchanges include large increases in communications bandwidths; the widespread adoption of computernetworking and public-key cryptography; mathematical innovations that promise a vast family ofprotocols for protecting identity in complex transactions; new digital media that support a widerange of social relationships; a new generation of technologically sophisticated privacy activists;a massive body of practical experience in the development and application of data-protection laws;and the rapid globalization of manufacturing, culture, and policy making. Theessays in this book provide a new conceptual framework for the analysis and debate of privacy policyand for the design and development of information systems. The authors are international experts inthe technical, economic, and political aspects of privacy; the book's strength is its synthesis ofthe three. The book provides equally strong analyses of privacy issues in the United States, Canada,and Europe. Contributors: Philip E. Agre, Victoria Bellotti, Colin J. Bennett,Herbert Burkert, Simon G. Davies, David H. Flaherty, Robert Gellman, Viktor Mayer-Schönberger, DavidJ. Phillips, Rohan Samarajiva.", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "0262511010"}, {"type": "ISBN_13", "identifier": "9780262511018"}], "pageCount": 325, "printType": ["Audiobook", "Hardcover"], "categories": ["Computers", "Technology"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=H2KB2DK4w78C&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=H2KB2DK4w78C&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "super fast", "price": 43}