{"id": "hLPYAAAAMAAJ", "title": "Religion of fear", "subtitle": "the politics of horror in conservative evangelicalism", "authors": ["Jason Bivins"], "publisher": "Oxford University Press, USA", "publishedDate": "2008", "description": "Conservative evangelicalism has transformed American politics, disseminating a sometimes fearful message not just through conventional channels, but through subcultures and alternate modes of communication. Within this world is a \"Religion of Fear,\" a critical impulse that dramatizes cultural and political conflicts and issues in frightening ways that serve to contrast \"orthodox\" behaviors and beliefs with those linked to darkness, fear, and demonology. Jason Bivins offers close examinations of several popular evangelical cultural creations including the Left Behind novels, church-sponsored Halloween \"Hell Houses,\" sensational comic books, especially those disseminated by Jack Chick, and anti-rock and -rap rhetoric and censorship. Bivins depicts these fascinating and often troubling phenomena in vivid (sometimes lurid) detail and shows how they seek to shape evangelical cultural identity. As the \"Religion of Fear\" has developed since the 1960s, Bivins sees its message moving from a place of relative marginality to one of prominence. What does it say about American public life that such ideas of fearful religion and violent politics have become normalized? Addressing this question, Bivins establishes links and resonances between the cultural politics of evangelical pop, the activism of the New Christian Right, and the political exhaustion facing American democracy. Religion of Fear is a significant contribution to our understanding of the new shapes of political religion in the United States, of American evangelicalism, of the relation of religion and the media, and the link between religious pop culture and politics.", "industryIdentifiers": [{"type": "OTHER", "identifier": "UOM:39015074064885"}], "pageCount": 317, "printType": ["Hardcover"], "categories": ["Political Science", "Horror"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=hLPYAAAAMAAJ&printsec=frontcover&img=1&zoom=5&source=public", "thumbnail": "http://books.google.com/books/content?id=hLPYAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=public"}, "language": "en", "deliveryOption": "fast", "price": 48}