{"id": "HoIDoJUJw7sC", "title": "Biodiversity and the Precautionary Principle", "subtitle": "\"Risk, Uncertainty and Practice in Conservation and Sustainable Use\"", "authors": ["Rosie Cooney", "Barney Dickson"], "publisher": "Routledge", "publishedDate": "2012-05-16", "description": "Great uncertainty typically surrounds decisions and management actions in the conservation of biodiversity and natural resource management, and yet there are risks of serious and irreversible harm for both biodiversity and the humans that rely on it. The precautionary principle arguably underlies all international conservation efforts and promotes acting to avoid serious or irreversible environmental harm, despite lack of scientific certainty as to the likelihood, magnitude or cause of harm. This book is the first to examine the application of the precautionary principle to biodiversity conservation and natural resource management, incorporating perspectives from scientists, economists, lawyers and practitioners from both developing and developed countries. It analyses the application and impacts of the principle in many areas including forestry, invasive alien species, wildlife trade, protected areas and fisheries, in a range of national and international contexts. Particular attention is drawn to issues of equity, livelihoods, science and politics, and the book provides guidelines for applying the precautionary principle to biodiversity conservation and natural resource management.", "industryIdentifiers": [{"type": "ISBN_13", "identifier": "9781136570995"}, {"type": "ISBN_10", "identifier": "1136570993"}], "pageCount": 336, "printType": ["Audiobook", "Paperback", "Hardcover"], "categories": ["Nature", "Science"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=HoIDoJUJw7sC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=HoIDoJUJw7sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "fast", "price": 47}