{"id": "i61JDQEACAAJ", "title": "Lost in You", "subtitle": null, "authors": ["Jules Bennett"], "publisher": "Zebra Books", "publishedDate": "2017-03-28", "description": "The only thing that could bring Liam Monroe back to Haven, Georgia, is his loyalty to his late sister--so he's agreed to serve as a chef at the resort his brothers have built in her honor. But he's not staying. At least that's the plan... Macy Hayward always admired the Monroes. Adopting four kids--including the brooding, mysterious Liam--they were an example of the loving family she wanted for herself someday. Now, ironically, Macy's got an unexpected new tenant in the apartment above her hardware store: none other than Liam. Most of Liam's furniture consists of weightlifting equipment, since he has no intention of settling in. He can't wait to run away again, from his brothers and his bitter memories--and from Macy, with her relentlessly seductive curves. Still, while he's around, he should do the poor woman a favor and teach her to cook, before she poisons someone... Soon, their sessions in the kitchen are getting spicy. But Macy has roots in Haven, and she wants to plant more, including taking in a little girl who needs a home. Meanwhile, Liam has an opportunity for his own restaurant in Atlanta. Will choosing love mean giving up their separate dreams? Or will the heart find a way'... Praise for Jules Bennett and Wrapped in You \"Another page turner--I couldn't put it down!\" --Lori Foster, New York Times bestselling author \"A solid contemporary.\" --Publishers Weekly", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "1420139126"}, {"type": "ISBN_13", "identifier": "9781420139129"}], "pageCount": 352, "printType": ["Hardcover"], "categories": ["Romance"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=i61JDQEACAAJ&printsec=frontcover&img=1&zoom=5&source=public", "thumbnail": "http://books.google.com/books/content?id=i61JDQEACAAJ&printsec=frontcover&img=1&zoom=1&source=public"}, "language": "en", "deliveryOption": "super fast", "price": 19}