{"id": "jAfK56DYc38C", "title": "Alguien Me Esta Devorando!", "subtitle": null, "authors": ["Andrea Rodríguez Vidal"], "publisher": "nicanitas · nicanitasantiago", "publishedDate": "2006-04-01", "description": "Introducing young readers to the complicated motivations involved in overeating, this book illustrates the mental dilemmas and preoccupations of an overeater and promotes open discussion between parents and their sons and daughters. As it illustrates the interior life of Jerry, this charming story explains that the food monster (Jerry's desire to eat) has grown so powerful that it is obscuring many of his other motivations, or FITS (Friends Inside the Self). By rediscovering his FITS—those that sing, run, listen to music, and stargaze—Jerry realizes the impact that food is having on his life and begins to regain control of his appetites and emotions. Las motivaciones complicadas de comida excesiva son introducidas a lectores en este cuento que ilustra las preocupaciones y dificultades mentales que causan el problema. Illustrando el mundo interior de Matías, el cuento muestra que el monstruo de comida (el deseo de comer) ha obtenido el poder de ocultar muchas otras motivaciones, como las de cantar, jugar, correr o mirar las estrellas. Lectores aprenden a reconocer esas emociones ocultadas para que puedan empezar a ver el impacto que tiene la comida en sus vidas, y recuperar el control de sus apetitos y emociones. El libro también presenta la oportunidad para padres a discutir la comida excesiva con su hijo o hija.", "industryIdentifiers": [{"type": "ISBN_13", "identifier": "9788496448018"}, {"type": "ISBN_10", "identifier": "8496448010"}], "pageCount": 32, "printType": ["Audiobook", "Hardcover"], "categories": ["Juvenile Fiction", "Fantasy"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=jAfK56DYc38C&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=jAfK56DYc38C&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "es", "deliveryOption": "fast", "price": 20}