{"id": "k1Rx4cXrPaUC", "title": "Digital Media Ethics", "subtitle": null, "authors": ["Charles Ess"], "publisher": "Polity", "publishedDate": "2009-03-16", "description": "This is the first textbook on the central ethical issues of digital media, ranging from computers and the Internet to mobile phones. It is also the first book of its kind to consider these issues from a global perspective, introducing ethical theories from multiple cultures. It further utilizes examples from around the world, such as the publication of ?the Mohammed Cartoons?; diverse understandings of what ?privacy? means in Facebook or MySpace; why pirating CDs and DVDs may be justified in developing countries; and culturally-variable perspectives on sexuality and what counts as ?pornography.? Readers and students thus acquire a global perspective on the central ethical issues of digital media, including privacy, copyright, pornography and violence, and the ethics of cross-cultural communication online. The book is designed for use across disciplines ? media and communication studies, computer science and informatics, as well as philosophy. It is up-to-date, accessible and student- and classroom-friendly: each topic and theory is interwoven throughout the volume with detailed sets of questions that foster careful reflection, writing, and discussion into these issues and their possible resolutions. Each chapter further includes additional resources and suggestions for further research and writing.", "industryIdentifiers": [{"type": "ISBN_13", "identifier": "9780745641638"}, {"type": "ISBN_10", "identifier": "0745641636"}], "pageCount": 256, "printType": ["Hardcover"], "categories": ["Social Science", "Internet"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=k1Rx4cXrPaUC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=k1Rx4cXrPaUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "fast", "price": 49}