{"id": "KRsFV6aIL2UC", "title": "The Protestant Ethic and the Spirit of Sport", "subtitle": "How Calvinism and Capitalism Shaped America's Games", "authors": ["Steven J. Overman"], "publisher": "Mercer University Press", "publishedDate": "2011", "description": "Steven Overman explores the concordant values of the Protestant ethic, capitalism, and sport by applying German scholar Max Weber's seminal thesis. Weber demonstrated a relationship between the Protestant ethic and a form of economic behavior he labeled the \"Spirit of capitalism.\" The work introduces readers to the doctrines and values experience, focusing on the framing of work and play in light of an intense unease with human pleasure and idleness. The United States is portrayed as the quintessential Protestant ethic society. The Protestant Ethic and the Spirit of Sport proposes \"seven Protestant virtues\" built upon rational asceticism and the work ethic that comprise the Protestant ethic. The spirit of capitalism is presented as a derivative of this ethic and a major force in shaping American institutions, notable organized sport. The second part of the book discusses the spirit of American sport as it is manifested in values the author identifies as the American sport ethic: seven constructs that correspond to the seven Protestant \"virtues.\" Each of these constructs, e.g., achieved status, competitiveness, is examined as it has influenced organized sport. The discussion encompasses youth sport, college sport, professional sport, and American influence on the modern Olympics. The book then analyzes sport as a form of consumer capitalism.", "industryIdentifiers": [{"type": "ISBN_13", "identifier": "9780881462265"}, {"type": "ISBN_10", "identifier": "0881462268"}], "pageCount": 423, "printType": ["Audiobook", "Paperback"], "categories": ["Religion", "Sports"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=KRsFV6aIL2UC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=KRsFV6aIL2UC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "fast", "price": 10}