{"id": "lGjcyY_ICYgC", "title": "Dystopian Fiction East and West", "subtitle": "Universe of Terror and Trial", "authors": ["Erika Gottlieb"], "publisher": "McGill-Queen's Press - MQUP", "publishedDate": "2001", "description": "In Dystopian Fiction East and West: Universe of Terror and Trial Erika Gottlieb offers an original and comprehensive exploration of dystopian fiction. She discusses Western classics such as Huxley's Brave New World, Orwell's Nineteen Eighty-Four, Bradbury's Farenheit 451, Vonnegut's Player Piano, Atwood's The Handmaid's Tale, and Zamiatin's We, all fictions that project expanded versions of the flaws of current society onto a hypothetical monster state in the future. These fictions work as prophetic warnings against a nightmare world that could, but should not be allowed to, come about. Gottlieb juxtaposes the Western dystopian genre with Eastern and Central European versions, introducing a selection of works from Russia, Poland, Hungary, and Czechoslovakia. She demonstrates that authors who write about and under totalitarian dictatorship find the worst of all possible worlds not in a hypothetical future but in the historical reality of the writer's present or recent past. Against such a background the writer assumes the role of witness, protesting against a nightmare world that is but should not be. She introduces the works of Victor Serge, Vassily Grossmam, Alexander Zinoviev, Tibor Dery, Arthur Koestler, Vaclav Havel, and Istvan Klima, as well as a host of others, all well-known in their own countries, presenting them within a framework established through an original and comprehensive exploration of the patterns underlying the more familiar Western works of dystopian fiction.", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "0773522069"}, {"type": "ISBN_13", "identifier": "9780773522060"}], "pageCount": 323, "printType": ["Paperback"], "categories": ["Fiction", "Science+Fiction"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=lGjcyY_ICYgC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=lGjcyY_ICYgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "fast", "price": 21}