{"id": "mjabAgAAQBAJ", "title": "DNS & BIND Cookbook", "subtitle": null, "authors": ["Cricket Liu"], "publisher": "\"O'Reilly Media, Inc.\"", "publishedDate": "2002-12-12", "description": "The DNS & BIND Cookbook presents solutions to the many problems faced by network administrators responsible for a name server. Following O'Reilly's popular problem-and-solution cookbook format, this title is an indispensable companion to DNS & BIND, 4th Edition, the definitive guide to the critical task of name server administration. The cookbook contains dozens of code recipes showing solutions to everyday problems, ranging from simple questions, like, \"How do I get BIND?\" to more advanced topics like providing name service for IPv6 addresses. It's full of BIND configuration files that you can adapt to your sites requirements. With the wide range of recipes in this book, you'll be able to Check whether a name is registered Register your domain name and name servers Create zone files for your domains Protect your name server from abuse Set up back-up mail servers and virtual email addresses Delegate subdomains and check delegation Use incremental transfer Secure zone transfers Restrict which queries a server will answer Upgrade to BIND 9 from earlier version Perform logging and troubleshooting Use IPv6 and much more. These recipes encompass all the day-to-day tasks you're faced with when managing a name server, and many other tasks you'll face as your site grows. Written by Cricket Liu, a noted authority on DNS, and the author of the bestselling DNS & BIND and DNS on Windows 2000, the DNS & BIND Cookbook belongs in every system or network administrator's library.", "industryIdentifiers": [{"type": "ISBN_13", "identifier": "9780596004101"}, {"type": "ISBN_10", "identifier": "0596004109"}], "pageCount": 222, "printType": ["Paperback", "Hardcover"], "categories": ["Computers", "Internet"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=mjabAgAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=mjabAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "super fast", "price": 21}