{"id": "mSyRx_Imw_8C", "title": "3ds Max 2012 Bible", "subtitle": null, "authors": ["Kelly L. Murdock"], "publisher": "John Wiley & Sons", "publishedDate": "2011-07-13", "description": "Updated version of the bestselling 3ds Max book on the market 3ds Max 2012 Bible is one of the most popular 3ds Max how-tos on the market. If you're a beginner just itching to create something right away, the Quick Start project in Part 1 is for you. If you're an experienced user checking out 3ds Max 2012's latest and greatest features, you'll love the fact that the 3ds Max 2012 Bible continues to be the most comprehensive reference on this highly complex application. Find out what's new, what's tried and true, and how creative you can get using the tips, tricks, and techniques in this must-have guide. Don't miss the 16-page color insert with examples from cutting-edge 3D artists, as well as the DVD packed with all kinds of extras. Loaded with expert advice, timesaving tips, and more than 150 step-by-step tutorials Highlights the work of some of today's most cutting-edge 3D artists in a 16-page color insert Includes a companion DVD with all examples from the book, including unique models and texture that you can customize DVD also features 500 pages of extra content from previous editions of the 3ds Max Bible, including a set of Quick Start tutorials If you want to gain 3ds Max 2012 skills, whether you're just beginning or not, this is the book you need to succeed.", "industryIdentifiers": [{"type": "ISBN_13", "identifier": "9781118123294"}, {"type": "ISBN_10", "identifier": "1118123298"}], "pageCount": 1312, "printType": ["Paperback", "Hardcover"], "categories": ["Computers", "Computers"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=mSyRx_Imw_8C&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=mSyRx_Imw_8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "super fast", "price": 40}