{"id": "N4jk7DZbR1oC", "title": "Personal Connections in the Digital Age", "subtitle": null, "authors": ["Nancy K. Baym"], "publisher": "Polity", "publishedDate": "2010-06-21", "description": "The internet and the mobile phone have disrupted many of our conventional understandings of our selves and our relationships, raising anxieties and hopes about their effects on our lives. This timely and vibrant book provides frameworks for thinking critically about the roles of digital media in personal relationships. Rather than providing exuberant accounts or cautionary tales, it offers a data-grounded primer on how to make sense of these important changes in relational life. The book identifies the core relational issues these media disturb and shows how the ways we talk about them echo historical discussions about earlier communication technologies. Chapters explore how we use mediated language and nonverbal behavior to develop and maintain communities, social networks, new relationships, and to maintain relationships in our everyday lives. It combines research findings with lively examples to address questions such as whether mediated interaction can be warm and personal, whether people are honest about themselves online, whether relationships that start online can work, and whether using these media damages the other relationships in our lives. Throughout, the book argues for approaching these questions with firm understandings of the qualities of media as well as the social and personal contexts in which they are developed and used. Personal Connections in the Digital Age will be required reading for all students and scholars of media, communication studies, and sociology, as well as all those who want a firmer understanding of digital media and everyday life.", "industryIdentifiers": [{"type": "ISBN_13", "identifier": "9780745643311"}, {"type": "ISBN_10", "identifier": "0745643310"}], "pageCount": 184, "printType": ["Paperback"], "categories": ["Social Science", "Internet"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=N4jk7DZbR1oC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=N4jk7DZbR1oC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "normal", "price": 12}