{"id": "NWHRciSLmuoC", "title": "Programación Gráfica para Ingenieros", "subtitle": null, "authors": ["José Miguel Molina Martínez", "Manuel Jiménez Buendía"], "publisher": "Marcombo", "publishedDate": "2010-06-01", "description": "El presente libro surge para que los alumnos que cursan estudios de Ingeniería, en sus diferentes especialidades, puedan comprender y aplicar la programación gráfica a la resolución de problemas reales en el ámbito ingenieril. Además de los fundamentos teóricos para comprender en qué consiste la Programación Gráfica, se ha dotado de un fuerte contenido práctico donde se muestra como, empleado este lenguaje de programación, el Ingeniero puede abordar y solucionar problemas muy tan diversos como el desarrollo de aplicaciones para realizar cálculos complejos de ingeniería o la automatización y control de procesos industriales, agrarios y alimentarios, etc. Además, se explica la forma de comunicar e interactuar con Controladores de Automatización Programables (PAC) y tarjetas y dispositivos de adquisición de datos (DAQ), etc. Asimismo se muestra cómo programar PLCs mediante OPC y su integración con otros equipos empleados en automatización y control. La evolución de los dispositivos móviles, el empleo de cámaras web para la supervisión de procesos, y las comunicaciones a través de Internet, son conjugadas en diversas aplicaciones donde se muestra la forma de resolver problemas específicos del ámbito de la ingeniería. Para el desarrollo de aplicaciones SCADA se trata, de una forma práctica, como cómo utilizar el módulo DSC. José Miguel Molina Martínez (Dr. Ingeniero Agrónomo) y Manuel Jiménez Buendía (Dr. Ingeniero en Automática), disponen de una trayectoria de más de 10 años como profesores e investigadores en la Universidad Politécnica de Cartagena. Además han dirigido y coordinado cursos y másteres de especialización sobre Programación Gráfica y desarrollo de aplicaciones SCADA. En la actualidad sus actividades de I+D+I se centran en el desarrollo tecnológico de equipos y software para la gestión de los recursos hídricos y energéticos.", "industryIdentifiers": [{"type": "ISBN_13", "identifier": "9788426716767"}, {"type": "ISBN_10", "identifier": "8426716768"}], "pageCount": 252, "printType": ["Audiobook", "Paperback"], "categories": ["Technology & Engineering", "Technology"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=NWHRciSLmuoC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=NWHRciSLmuoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "es", "deliveryOption": "super fast", "price": 7}