{"id": "NY8mHf5WVLcC", "title": "Web Standards Solutions", "subtitle": "The Markup and Style Handbook, Special Edition", "authors": ["Daniel Cederholm"], "publisher": "Apress", "publishedDate": "2009-10-21", "description": "Welcome to the expanded second edition of Dan Cederholm's bestselling Web Standards Solutions. Web standards are the standard technology specifications enforced by the World Wide Web Consortium (W3C) to make sure that web designers and browser manufacturers are using the same technology syntax. It is important that these implementations are the same throughout the Web—otherwise, it becomes a messy proprietary place, and lacks consistency. These standards also allow content to be more compatible with multiple different viewing devices, such as screen readers for people with vision impairments, cell phones, PDFs, etc. HTML, XML, and CSS are all such technologies. This book is your essential guide to understanding the advantages you can bring to your web pages by implementing web standards and precisely how to apply them. Web standards such as XHTML and CSS are now fairly well-known technologies, and they will likely be familiar to you, the web designer. Indeed, they are all around you on the Web. However, within web standards still lies a challenge: while the browser's support for web standards is steadily increasing, many web developers and designers have yet to discover the real benefits of web standards and respect the need to adhere to them. The real art is in truly understanding the benefits and implementing the standards efficiently. As a simple example of its power, you can use CSS to lay out your pages instead of nesting tables. This can make file sizes smaller, allowing pages to load faster, ultimately increasing accessibility for all browsers, devices, and web users. Expanded edition containing bonus material. Teaches how to use Web standards effectively to build better web sites. Solutions style promotes learning by work-through examples and assessments.", "industryIdentifiers": [{"type": "ISBN_13", "identifier": "9781430219217"}, {"type": "ISBN_10", "identifier": "1430219211"}], "pageCount": 300, "printType": ["Audiobook", "Paperback"], "categories": ["Computers", "Computers"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=NY8mHf5WVLcC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=NY8mHf5WVLcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "fast", "price": 35}