{"id": "pIYjvgAACAAJ", "title": "Run to Ground", "subtitle": null, "authors": ["Katie Ruggle"], "publisher": "Sourcebooks Casablanca", "publishedDate": "2017-06-06", "description": "\"Vivid and charming.\" --CHARLAINE HARRIS, #1 New York Times bestselling author of the Sookie Stackhouse series He lost his mentor. He lost his K9 partner. He almost lost his will to live. But when a ruthless killer targets a woman on the run, Theo and his new K9 companion will do whatever it takes to survive--and save the woman neither can live without. Grieving the death of his partner, Theo Bosco has no room in his life for distractions. Though his instincts scream that he should avoid Juliet 'Jules' Jackson, he can't seem to stay away. It doesn't help that Theo's new K9 companion has fallen head over paws with Jules's rambunctious family. Or that when he's with her, Theo finally knows peace. When Jules rescued her siblings, whisking them away to the safety of the beautifully rugged Colorado Rockies, she never expected to catch the eye--or the heart--of a cop. Yet as Jules struggles to fight her growing attraction to the brooding K9 officer, another threat lurks much closer to home... And this time, there's no escape. Rocky Mountain K-9 Unit: Run to Ground (Book 1) On the Chase (Book 2) What People Are Saying: \"I love Ruggle's characters. They're sharply drawn, and vividly alive. I'm happy when they find each other. These are wonderful escapist books.\"--CHARLAINE HARRIS, #1 New York Times Bestselling author of the Sookie Stackhouse series \"Sexy and suspenseful, I couldn't turn the pages fast enough.\"--JULIE ANN WALKER, New York Times and USA Today Bestselling Author for Hold Your Breath \"Chills and thrills and a sexy slow-burning romance from a terrific new voice.\"--D.D. AYRES, author of the K-9 Rescue Series for Hold Your Breath", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "1492643041"}, {"type": "ISBN_13", "identifier": "9781492643043"}], "pageCount": 416, "printType": ["Audiobook", "Hardcover"], "categories": ["Fiction", "Romance"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=pIYjvgAACAAJ&printsec=frontcover&img=1&zoom=5&source=public", "thumbnail": "http://books.google.com/books/content?id=pIYjvgAACAAJ&printsec=frontcover&img=1&zoom=1&source=public"}, "language": "en", "deliveryOption": "fast", "price": 45}