{"id": "qAi3BgAAQBAJ", "title": "Duchenne Muscular Dystrophy", "subtitle": null, "authors": ["Alan E. H. Emery", "Francesco Muntoni", "Rosaline C. M. Quinlivan"], "publisher": "OUP Oxford", "publishedDate": "2015-02-19", "description": "Duchenne Muscular Dystrophy, an inherited and progressive muscle wasting disease, is one of the most common single gene disorders found in the developed world. In this fourth edition of the classic monograph on the topic, Alan Emery and Francesco Muntoni are joined by Rosaline Quinlivan, Consultant in Neuromuscular Disorders, to provide a thorough update on all aspects of the disorder. Recent understanding of the nature of the genetic defect responsible for Duchenne Muscular Dystrophy and isolation of the protein dystrophin has led to the development of new theories for the disease's pathogenesis. This new edition incorporates these advances from the field of molecular biology, and describes the resultant opportunities for screening, prenatal diagnosis, genetic counselling and from recent pioneering work with anti-sense oligonucleotides, the possibility of effective RNA therapy. Although there is still no cure for the disorder, there have been significant developments concerning the gene basis, publication of standards of care guidelines, and improvements in management leading to significantly longer survival, particularly with cardio-pulmonary care. The authors also investigate other forms of pharmacological, cellular and gene therapies. Duchenne Muscular Dystrophy will be essential reading not only for scientists and clinicians, but will also appeal to therapists and other professionals involved in the care of patients with muscular dystrophy.", "industryIdentifiers": [{"type": "ISBN_13", "identifier": "9780191503665"}, {"type": "ISBN_10", "identifier": "0191503665"}], "pageCount": 320, "printType": ["Audiobook", "Paperback", "Hardcover"], "categories": ["Medical", "Science"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=qAi3BgAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=qAi3BgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "fast", "price": 18}