{"id": "RltaPlIHlrAC", "title": "Landscape Erosion and Evolution Modeling", "subtitle": null, "authors": ["Russell S. Harmon", "William W. Doe"], "publisher": "Springer Science & Business Media", "publishedDate": "2001-12-31", "description": "Landscapes are characterized by a wide variation, both spatially and temporally, of tolerance and response to natural processes and anthropogenic stress. These tolerances and responses can be analyzed through individual landscape parameters, such as soils, vegetation, water, etc., or holistically through ecosystem or watershed studies. However, such approaches are both time consuming and costly. Soil erosion and landscape evolution modeling provide a simulation environment in which both the short- and long-term consequences of land-use activities and alternative land use strategies can be compared and evaluated. Such models provide the foundation for the development of land management decision support systems. Landscape Erosion and Evolution Modeling is a state-of-the-art, interdisciplinary volume addressing the broad theme of soil erosion and landscape evolution modeling from different philosophical and technical approaches, ranging from those developed from considerations of first-principle soil/water physics and mechanics to those developed empirically according to sets of behavioral or empirical rules deriving from field observations and measurements. The validation and calibration of models through field studies is also included. This volume will be essential reading for researchers in earth, environmental and ecosystem sciences, hydrology, civil engineering, forestry, soil science, agriculture and climate change studies. In addition, it will have direct relevance to the public and private land management communities.", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "0306467186"}, {"type": "ISBN_13", "identifier": "9780306467189"}], "pageCount": 540, "printType": ["Audiobook"], "categories": ["Mathematics", "Science"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=RltaPlIHlrAC&printsec=frontcover&img=1&zoom=5&source=public", "thumbnail": "http://books.google.com/books/content?id=RltaPlIHlrAC&printsec=frontcover&img=1&zoom=1&source=public"}, "language": "en", "deliveryOption": "fast", "price": 15}