{"id": "SeGyrCfYs2AC", "title": "Science and Civilisation in China: Volume 4, Physics and Physical Technology, Part 2, Mechanical Engineering", "subtitle": null, "authors": ["Joseph Needham"], "publisher": "Cambridge University Press", "publishedDate": "1965-01-02", "description": "As Dr Needham's immense undertaking gathers momentum it has been found necessary to subdivide volumes into parts, each to be bound and published separately. The first part of Volume 4, already published, deals with the physical sciences; the second with the diverse applications of physics in the many branches of mechanical engineering; and the third will deal with civil and hydraulic engineering and nautical technology. With this part of Volume 4, then, we come to the application by the Chinese of physical principles in the control of forces and in the use of power; we cross the frontier separating tools from the machine. We have already noticed that the ancient Chinese concept of chhi (somewhat similar to the pneuma of the Greeks) asserted itself prominently in acoustics; but we discover here that the Chinese tendency to think pneumatically was also responsible for a whole range of brilliant technological achievements, for example, the double-acting piston-bellows, the rotary winnowing-fan, and the water-powered metallurgical blowing-machine (ancestor of the steam-engine); as well as for some extraordinary insights and predictions in aeronautics.", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "0521058031"}, {"type": "ISBN_13", "identifier": "9780521058032"}], "pageCount": 816, "printType": ["Audiobook", "Hardcover"], "categories": ["Science", "Technology"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=SeGyrCfYs2AC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=SeGyrCfYs2AC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "normal", "price": 14}