{"id": "SEzVS14HGB8C", "title": "The Middle Works, 1899-1924: 1915", "subtitle": null, "authors": ["John Dewey", "Jo Ann Boydston", "Sidney Hook"], "publisher": "SIU Press", "publishedDate": "2008-04-01", "description": "Volume 11 brings together all of Dewey's writings for 1918 and 1919. A Modern Language Association Committee on Scholarly Editions textual edition. Dewey's dominant theme in these pages is war and its after-math. In the Introduction, Oscar and Lilian Handlin discuss his philosophy within the historical context: The First World War slowly ground to its costly conclusion; and the immensely more difficult task of making peace got painfully under way. The armi-stice that some expected would permit a return to normalcy opened instead upon a period of turbulence that agitated fur-ther a society already unsettled by preparations for battle and by debilitating conflict overseas. After spending the first half of 1918-19 on sabbatical from Columbia at the University of California, Dewey traveled to Japan and China, where he lectured, toured, and assessed in his essays the relationship between the two nations. From Peking he reported the student revolt known as the May Fourth Move-ment. The forty items in this volume also include an analysis of Thomas Hobbe's philosophy; an affectionate commemorative tribute to Theodore Roosevelt, our Teddy; the syllabus for Dewey's lectures at the Imperial University in Tokyo, which were later revised and published as Reconstruction in Philosophy; an exchange with former disciple Randolph Bourne about F. Mat-thias Alexander's Man's Supreme Inheritance; and, central to Dew-ey's creed, Philosophy and Democracy. His involvement in a study of the Polish-American community in Philadelphia--resulting in an article, two memoranda, and a lengthy report--is discussed in detail in the Introduction and in the Note on the Confidential Report ofConditions among the Poles in the United States.", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "0809328038"}, {"type": "ISBN_13", "identifier": "9780809328031"}], "pageCount": 546, "printType": ["Hardcover"], "categories": ["Education", "Politics"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=SEzVS14HGB8C&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=SEzVS14HGB8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "normal", "price": 18}