{"id": "sW34nQEACAAJ", "title": "Pearl's Oyster Bar", "subtitle": null, "authors": ["Rodney C. Hosford", "Laurie Hosford", "Paula Kiger"], "publisher": "CreateSpace", "publishedDate": "2013-07-03", "description": "Pearl has lived an exciting life. At 37 she owns the most popular bar and restaurant on Panama City Beach. She is in love with two handsome and very dangerous men. Customers from all over the South flock to her business to eat her fresh seafood, ask her about the movie stars, rock and roll legends and professional athletes she has dated, and about her short TV career as a bikini clad lifeguard. The many battered females she has rescued from the Safe Haven are wonderful employees and love her like a sister. Pearl enjoys training the men in her life how to treat her. Also, she is dedicated to teaching and punishing abusive men that mistreat the females in their lives. Now her life has changed. Her Navy Seal husband will retire in 30 days. How will she keep him from finding out about her boyfriend, a former major league baseball pitcher? That problem pales when she finds out that her sweet but sickly goddaughter has been kidnapped by a serial killer who has been snatching up young girls for years. Law enforcement has not been able to catch the beast. Pearl decides to use her training as an Air Force Investigator, help from her Uncle, a retired sheriff and from her best friend, a state representative to catch the serial killer and deliver her own form of justice.", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "1489519378"}, {"type": "ISBN_13", "identifier": "9781489519375"}], "pageCount": 354, "printType": ["Audiobook", "Hardcover"], "categories": ["Fiction", "Thrillers"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=sW34nQEACAAJ&printsec=frontcover&img=1&zoom=5&source=public", "thumbnail": "http://books.google.com/books/content?id=sW34nQEACAAJ&printsec=frontcover&img=1&zoom=1&source=public"}, "language": "en", "deliveryOption": "super fast", "price": 43}