{"id": "t_Gqcu-QbcAC", "title": "The Eloquence of Edward Everett", "subtitle": "America's Greatest Orator", "authors": ["Richard A. Katula"], "publisher": "Peter Lang", "publishedDate": "2010", "description": "Edward Everett (1794-1865) was America’s first Ph.D., a United States Congressman, Governor of Massachusetts, Ambassador to England, President of Harvard University, Secretary of State, a United States Senator, and a Vice-Presidential candidate. In the midst of this distinguished career, he was also a famous and profound orator, delivering hundreds of orations across the nation, and at least five of the most important speeches in American history. In this book, Everett’s training as an orator and his career on the public stage are reviewed in the context of his times, often referred to as the Golden Age of American oratory. Through analyses of a number of his most illustrious orations – such as the Phi Beta Kappa Society oration in 1824; his 4th of July oration at Worcester, Massachusetts; his eulogy to John Quincy Adams in 1848; his speech that saved Mount Vernon, «The Character of Washington», delivered 137 times from 1856-1860; and his Gettysburg Oration, delivered just prior to Lincoln’s illustrious Gettysburg Address – Everett is seen as a transformational figure. The book concludes that while unknown to most Americans, Everett’s rhetoric of idealism, optimism, sentimentality, and conciliation provided the rising nation – America – with its sense of identity and its core principles.", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "1433110296"}, {"type": "ISBN_13", "identifier": "9781433110290"}], "pageCount": 166, "printType": ["Audiobook", "Hardcover"], "categories": ["History", "History"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=t_Gqcu-QbcAC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=t_Gqcu-QbcAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "normal", "price": 38}