{"id": "uO5VCgAAQBAJ", "title": "The Planet Remade", "subtitle": "The Challenge of Imagining Deliberate Climate Change", "authors": ["Oliver Morton"], "publisher": "Granta Books", "publishedDate": "2015-10-01", "description": "Despite the on-going political horse-trading over emissions targets, each piece of new scientific research offers further evidence that no feasible reduction in the emissions can now effectively mitigate the carbon crisis. With limited time for action, an increasingly influential minority of climate scientists are exploring proposals for planned human intervention in the biosphere. A stratospheric veil against the sun; the cultivation of photosynthetic plankton; a fleet of unmanned ships seeding clouds: these are technologies from the radical fringes of climate study, and they are chilling, not least given the risk of hostile use. And yet, we're now at the point where we have no choice but to take them very seriously indeed. The Planet Remade explores the science, history and politics behind these strategies. It looks at who might want to see geo-engineering techniques used, and why - and why others would be dead set against any such attempts. Throughout history, people have made huge changes to the planet - to the clouds and the soils, to the winds and the seas, to the great cycles of nitrogen and carbon - that are far more profound than often realized, and which can help us to fundamentally rethink our responses to global warming. With sensitivity, insight and expert science, Oliver Morton unpicks the moral implications of our responses to climate change, our fear that people have become a force of nature, and the potential for good in having such power. The Planet Remade is about imagining a world where people take care instead of taking control.", "industryIdentifiers": [{"type": "ISBN_13", "identifier": "9781783780976"}, {"type": "ISBN_10", "identifier": "1783780975"}], "pageCount": null, "printType": ["Audiobook", "Paperback", "Hardcover"], "categories": ["Nature", "Science"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=uO5VCgAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=uO5VCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "normal", "price": 38}