{"id": "UzIlDwAAQBAJ", "title": "Olympic Education", "subtitle": "An International Review", "authors": ["Roland Naul", "Deanna Binder", "Antonin Rychtecky", "Ian Culpan"], "publisher": "Taylor & Francis", "publishedDate": "2017-02-17", "description": "A fundamental component of the Olympic ideal is the concept of Olympic education. This is the notion that sport can help children and young people develop essential life skills. Olympic Education: An international review is the first book to offer a comprehensive survey of the diffusion and implementation of Olympic education programmes around the world. The book includes 28 chapters with 21 national case studies of countries on every major continent, including Australia, Brasil, Canada, China, France, Germany, Japan, Russia, Spain, the UK, the US and Zambia. Each chapter examines the cultural, pedagogical, political and societal challenges of teaching Olympic education, as well as the national, individual and institutional programmes that have emerged. It explores key practical and conceptual issues, such as the incorporation of Olympic values in PE curricula, sport coaching and coach education programmes, while also taking into account the collaborative efforts of the governmental bodies, sport federations and Olympic institutions responsible for policy and implementation. This is important reading for all students, researchers and professionals with an interest in the Olympics, sport education, sports coaching, sport policy or physical education.", "industryIdentifiers": [{"type": "ISBN_13", "identifier": "9781136476129"}, {"type": "ISBN_10", "identifier": "1136476121"}], "pageCount": 385, "printType": ["Audiobook", "Hardcover"], "categories": ["Education", "Sports"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=UzIlDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=UzIlDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "fast", "price": 20}