{"id": "W8h1h8wa2yQC", "title": "Masculinities", "subtitle": null, "authors": ["R. W. Connell"], "publisher": "Polity", "publishedDate": "2005", "description": "This is an exciting new edition of R. W. Connell's ground-breaking text, which has become a classic work on the nature and construction of masculine identity. Connell argues that there is not one masculinity, but many different masculinities, each associated with different positions of power. In a world gender order that continues to privilege men over women, but also raises difficult issues for men and boys, Connell's account is more pertinent than ever before. In a substantial new introduction and conclusion, Connell discusses the development of masculinity studies in the ten years since the book's initial publication. The book explores global gender relations, new theories, and practical uses of masculinity research. Looking to the future, a new concluding chapter addresses the politics of masculinities, and the implications of masculinity research for understanding current world issues. Against the backdrop of an increasingly divided world, dominated by neo-conservative politics, Connell's account highlights a series of compelling questions about the future of human society. This second edition of Connell's classic book will be essential reading for students taking courses on masculinities and gender studies, and will be of interest to students and scholars across the humanities and social sciences.", "industryIdentifiers": [{"type": "ISBN_13", "identifier": "9780745634265"}, {"type": "ISBN_10", "identifier": "0745634265"}], "pageCount": 324, "printType": ["Audiobook", "Paperback", "Hardcover"], "categories": ["Body image", "Politics"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=W8h1h8wa2yQC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=W8h1h8wa2yQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "super fast", "price": 48}