{"id": "Wc3hDQAAQBAJ", "title": "From Tool to Partner", "subtitle": "The Evolution of Human-Computer Interaction", "authors": ["Jonathan Grudin"], "publisher": "Morgan & Claypool Publishers", "publishedDate": "2017-01-02", "description": "This is the first comprehensive history of human-computer interaction (HCI). Whether you are a user experience professional or an academic researcher, whether you identify with computer science, human factors, information systems, information science, design, or communication, you can discover how your experiences fit into the expanding field of HCI. You can determine where to look for relevant information in other fields—and where you won’t find it. This book describes the different fields that have participated in improving our digital tools. It is organized chronologically, describing major developments across fields in each period. Computer use has changed radically, but many underlying forces are constant. Technology has changed rapidly, human nature very little. An irresistible force meets an immovable object. The exponential rate of technological change gives us little time to react before technology moves on. Patterns and trajectories described in this book provide your best chance to anticipate what could come next. We have reached a turning point. Tools that we built for ourselves to use are increasingly influencing how we use them, in ways that are planned and sometimes unplanned. The book ends with issues worthy of consideration as we explore the new world that we and our digital partners are shaping.", "industryIdentifiers": [{"type": "ISBN_13", "identifier": "9781627059473"}, {"type": "ISBN_10", "identifier": "1627059474"}], "pageCount": 150, "printType": ["Audiobook", "Paperback"], "categories": ["Computers", "Computers"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=Wc3hDQAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=Wc3hDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "super fast", "price": 22}