{"id": "WeTHMEPj1ooC", "title": "Is Science Multicultural?", "subtitle": "Postcolonialisms, Feminisms, and Epistemologies", "authors": ["Sandra G. Harding"], "publisher": "Indiana University Press", "publishedDate": "1998", "description": "Is Science Multicultural? explores what the last three decades of European/American, feminist, and postcolonial science and technology studies can learn from each other. Sandra Harding introduces and discusses an array of postcolonial science studies, and their implications for \"northern\" science. All three science studies strains have developed in the context of post-World War II science and technology projects. They illustrate how technoscientific projects mean different things to different groups. The meaning attached by the culture of the West may not be shared or may be diametrically opposite in the cultures in other parts of the world. All, however, would agree that scientific projects--modern science included--are \"local knowledge systems.\" The interests and discursive resources that the various science studies bring groups to their projects, and the ways that they organize the production of their kind of science studies, are distinctively culturally-local also. While their projects may be unintentionally converging, they also conflict in fundamental respects. How is this inevitable cultural-situatedness of knowledge both an invaluable resource as well as a limitation on the advance of knowledge about nature? What are the distinctive resources that the feminist and postcolonial science theorists offer in thinking about the history of modern science; the diversity of \"scientific\" traditions in non-European as well as in European cultures; and the directions that might be taken by less androcentric and Eurocentric scientific projects? How might modern sciences' projects be linked more firmly to the prodemocratic yearnings that are so widely voiced in contemporary life? Carefully balancing poststructuralist and conventional epistemological resources, this study concludes by proposing new directions for thinking about objectivity, method, and reflexivity in light of the new understandings developed in the post-World War II world.", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "0253211565"}, {"type": "ISBN_13", "identifier": "9780253211569"}], "pageCount": 242, "printType": ["Audiobook"], "categories": ["Science", "Technology"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=WeTHMEPj1ooC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=WeTHMEPj1ooC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "normal", "price": 34}