{"id": "Winf_4mif90C", "title": "History of the Mafia", "subtitle": null, "authors": ["Salvatore Lupo"], "publisher": "Columbia University Press", "publishedDate": "2010-06-01", "description": "When we think of the Italian Mafia, we think of Marlon Brando, Tony Soprano, and the Corleones& mdash;iconic actors and characters who give shady dealings a mythical pop presence. Yet these sensational depictions take us only so far. The true story of the Mafia reveals both an organization and mindset dedicated to the preservation of tradition. It is no accident that the rise of the Mafia coincided with the unification of Italy and the influx of immigrants into America. The Mafia means more than a horse head under the sheets& mdash;it functions as an alternative to the state, providing its own social and political justice. Combining a nuanced history with a unique counternarrative concerning stereotypes of the immigrant, Salvatore Lupo, a leading historian of modern Italy and a major authority on its criminal history, has written the definitive account of the Sicilian Mafia from 1860 to the present. Consulting rare archival sources, he traces the web of associations, both illicit and legitimate, that have defined Cosa Nostra during its various incarnations. He focuses on several crucial periods of transition: the Italian unification of 1860 to 1861, the murder of noted politician Notarbartolo, fascist repression of the Mafia, the Allied invasion of 1943, social conflicts after each world war, and the major murders and trials of the 1980s. Lupo identifies the internal cultural codes that define the Mafia and places these codes within the context of social groups and communities. He also challenges the belief that the Mafia has grown more ruthless in recent decades. Rather than representing a shift from \"honorable\" crime to immoral drug trafficking and violence, Lupo argues the terroristic activities of the modern Mafia signify a new desire for visibility and a distinct break from the state. Where these pursuits will take the family adds a fascinating coda to Lupo's work.", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "0231505396"}, {"type": "ISBN_13", "identifier": "9780231505390"}], "pageCount": 352, "printType": ["Audiobook", "Paperback", "Hardcover"], "categories": ["History", "History"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=Winf_4mif90C&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=Winf_4mif90C&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "super fast", "price": 10}