{"id": "wxDkz6akXiwC", "title": "Advances in Sport Psychology", "subtitle": null, "authors": ["Thelma S. Horn"], "publisher": "Human Kinetics", "publishedDate": "2008", "description": "The updated third edition of Advances in Sport Psychologyoffers a view of the latest research in the field of sport psychology. The text is written by 34 of the field's most prolific researchers and scholars, including Maureen Weiss, Shane Murphy, and Albert Carron. These contributors extend the boundaries that have defined the field and provide a clear direction for future research. This third edition has been completely revised to reflect the advances that have occurred in the field within the past several years. The text provides readers with a complete picture of current research and emerging topics in sport psychology while challenging researchers to examine the factors that keep this discipline growing. Advances in Sport Psychology, Third Edition, provides a fresh look at sport psychology with these features: -Four new chapters on qualitative research methods, achievement goal theories, self-confidence, and family and peer influences -Significant revisions of the second-edition chapters, along with more concise overviews of individual topics -An analysis and synthesis of the state of knowledge for each topic and a discussion of future research directions The text focuses on the most important and active areas of current research, which recognize the merging of individual and socioenvironmental factors in making sense of sport performance and behavior. Each chapter includes a definition of terms, an explanation of the chapter's scope, and an outline of the sections. The author then provides a review of the available research and theory on the chapter's main topic, analyzes the state of knowledge in the area, and devotes significant space to future research directions. The book is divided into four parts. Part Ioffers a comprehensive introduction to the field, including definitions, history, and research paradigms and methodologies. Part IIexplores individual characteristics that affect sport participants' behavior, including self-perceptions, attributional patterns and perceptions of control, motivational orientations, and achievement goal perspectives. Part IIIexplores socioenvironmental factors that affect sport participants' behaviors. Part IVdelves into the research and theory concerning intervention techniques used for enhancing performance and modifying athletes' behaviors, including imagery and mental rehearsal, attentional processes, goal setting, and flow and peak performance. Advances in Sport Psychology, Third Edition, offers a new and thorough understanding of where sport psychology has been, where it is now, and where it is headed. This text will help students prepare and conduct their own research, and it will be a great reference for professionals who want to stay on the cutting-edge of the field.", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "0736057358"}, {"type": "ISBN_13", "identifier": "9780736057356"}], "pageCount": 499, "printType": ["Paperback"], "categories": ["Medical", "Sports"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=wxDkz6akXiwC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=wxDkz6akXiwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "fast", "price": 31}