{"id": "x3TYDQAAQBAJ", "title": "The Death of Expertise", "subtitle": null, "authors": ["Tom Nichols"], "publisher": "Oxford University Press", "publishedDate": "2017", "description": "People are now exposed to more information than ever before, provided both by technology and by increasing access to every level of education. These societal gains, however, have also helped fuel a surge in narcissistic and misguided intellectual egalitarianism that has crippled informed debates on any number of issues. Today, everyone knows everything: with only a quick trip through WebMD or Wikipedia, average citizens believe themselves to be on an equal intellectual footing with doctors and diplomats. All voices, even the most ridiculous, demand to be taken with equal seriousness, and any claim to the contrary is dismissed as undemocratic elitism. As Tom Nichols shows in The Death of Expertise, this rejection of experts has occurred for many reasons, including the openness of the internet, the emergence of a customer satisfaction model in higher education, and the transformation of the news industry into a 24-hour entertainment machine. Paradoxically, the increasingly democratic dissemination of information, rather than producing an educated public, has instead created an army of ill-informed and angry citizens who denounce intellectual achievement. Nichols has deeper concerns than the current rejection of expertise and learning, noting that when ordinary citizens believe that no one knows more than anyone else, democratic institutions themselves are in danger of falling either to populism or to technocracy-or in the worst case, a combination of both. The Death of Expertise is not only an exploration of a dangerous phenomenon but also a warning about the stability and survival of modern democracy in the Information Age.", "industryIdentifiers": [{"type": "ISBN_13", "identifier": "9780190469412"}, {"type": "ISBN_10", "identifier": "0190469412"}], "pageCount": 272, "printType": ["Audiobook", "Paperback"], "categories": ["Education, Higher", "Internet"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=x3TYDQAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=x3TYDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "super fast", "price": 16}