{"id": "XaViQgAACAAJ", "title": "Antisense Technology in the Central Nervous System", "subtitle": null, "authors": ["Ronald A. Leslie", "Jackie Hunter", "Harold A. Robertson"], "publisher": "Oxford University Press, USA", "publishedDate": "1999", "description": "Antisense technology has been used for several years to \"knock down\" the expression of specific genes in living tissues to study the functions of their protein products. Specifically designed antisense oligonucleotides (ODNs) are short lengths of man-made genetic material designed to interfere with the production of the protein encoded by the gene. This can shed light on the function of the protein; alternatively, if a disease process results from an excess of a certain protein, the method can in theory correct the problem. Faster than transgenic techniques, but more problematic in practice, antisense has been seen as something of a \"black art\". There are many technical problems to understand and overcome. This is the first book to provide a critical review of the uses of this technology in the central nervous system. It includes: Background to the technology problems of design and synthesis of antisense molecules administration in the brain protection of ODNs from metabolic destruction potent for CNS research and therapy. Antisense Technology in the Central Nervous System describes the promises and the pitfalls of this approach, and compares it to other approaches. The practical experience of leading researchers is combined with a thorough description of the theoreticalfoundation of the technique, making the book ideal for researchers and clinicians alike.", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "0198505388"}, {"type": "ISBN_13", "identifier": "9780198505389"}], "pageCount": 250, "printType": ["Audiobook", "Hardcover"], "categories": ["Medical", "Science"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=XaViQgAACAAJ&printsec=frontcover&img=1&zoom=5&source=public", "thumbnail": "http://books.google.com/books/content?id=XaViQgAACAAJ&printsec=frontcover&img=1&zoom=1&source=public"}, "language": "en", "deliveryOption": "fast", "price": 11}