{"id": "ygtHl_HpclUC", "title": "Managing and Conserving Grassy Woodlands", "subtitle": null, "authors": ["S McIntyre", "JG McIvor", "KM Heard"], "publisher": "CSIRO PUBLISHING", "publishedDate": "2004-08-02", "description": "In eastern Australia, grassy eucalypt woodlands have been under severe pressure from agricultural development, with problems of land degradation and species decline being most severe in the cropping lands of south-eastern Australia. Managing and Conserving Grassy Woodlands describes a set of principles that will enable landholders to maintain or increase productivity without compromising ecological sustainability, and at the same time maintaining a substantial proportion of the native flora and fauna. The book provides the technical foundations underpinning the principles and explains the importance of planning at a landscape scale. Each major principle is addressed in a separate chapter which explains the scientific understanding behind the principle and which discusses some of the issues relating to its practical application. Additional chapters outline the basic ecological concepts underpinning the principles and the responses of landholders who have had the opportunity to discuss and reflect on the principles. For those interested in translating the principles into a property plan, a final chapter explores the steps that can be taken. Managing and Conserving Grassy Woodlands is intended for those at the interface of disciplinary research and on-ground application, whether they are working in research, regional planning, extension, landcare or land management.", "industryIdentifiers": [{"type": "ISBN_13", "identifier": "9780643099227"}, {"type": "ISBN_10", "identifier": "0643099220"}], "pageCount": 264, "printType": ["Audiobook", "Hardcover"], "categories": ["Technology & Engineering", "Science"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=ygtHl_HpclUC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=ygtHl_HpclUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "normal", "price": 19}