{"id": "YiHHnV08ebkC", "title": "A Pest in the Land", "subtitle": "New World Epidemics in a Global Perspective", "authors": ["Suzanne Austin Alchon"], "publisher": "UNM Press", "publishedDate": "2003", "description": "This study of disease among the native peoples of the New World before and after 1492 challenges many widely held notions about encounters between European and native peoples. Whereas many late twentieth century scholars blamed the catastrophic decline of postconquest native populations on the introduction of previously unknown infections from the Old World, Alchon argues that the experiences of native peoples in the New World closely resembled those of other human populations. Exposure to lethal new infections resulted in rates of morbidity and mortality among native Americans comparable to tose found among Old World populations. Why then did native American populations decline by 75 to 90 percent in the century following contact with Europeans? Why did these populations fail to recover, in contrast to those of Africa, Asia, and Europe? Alchon points to the practices of European colonialism. Warfare and slavery increased mortality, and forced migrations undermined social, political, and economic institutions. This timely study effectively overturns the notion of New World exceptionalism. By showing that native Americans were not uniquely affected by European diseases, Alchon also undercuts the stereotypical notion of the Americas as a new Eden, free of disease and violence until the intrusion of germ-laden, rapacious Europeans.", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "0826328717"}, {"type": "ISBN_13", "identifier": "9780826328717"}], "pageCount": 214, "printType": ["Audiobook", "Paperback", "Hardcover"], "categories": ["History", "History"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=YiHHnV08ebkC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=YiHHnV08ebkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "super fast", "price": 8}