{"id": "z9qv32OyEu4C", "title": "SAS for Mixed Models, Second Edition", "subtitle": null, "authors": ["Ramon C. Littell, Ph.D.", "Walter W. Stroup, Ph.D.", "George A. Milliken, Ph.D.", "Russell D. Wolfinger, Ph.D.", "Oliver Schabenberger, Ph.D."], "publisher": "SAS Institute", "publishedDate": "2006-02-21", "description": "The indispensable, up-to-date guide to mixed models using SAS. Discover the latest capabilities available for a variety of applications featuring the MIXED, GLIMMIX, and NLMIXED procedures in SAS for Mixed Models, Second Edition, the comprehensive mixed models guide for data analysis, completely revised and updated for SAS 9 by authors Ramon Littell, George Milliken, Walter Stroup, Russell Wolfinger, and Oliver Schabenberger. The theory underlying the models, the forms of the models for various applications, and a wealth of examples from different fields of study are integrated in the discussions of these models: random effect only and random coefficients models; split-plot, multilocation, and repeated measures models; hierarchical models with nested random effects; analysis of covariance models; spatial correlation models; generalized linear mixed models; and nonlinear mixed models. Professionals and students with a background in two-way ANOVA and regression and a basic knowledge of linear models and matrix algebra will benefit from the topics covered. This book is part of the SAS Press program.", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "1599940787"}, {"type": "ISBN_13", "identifier": "9781599940786"}], "pageCount": 828, "printType": ["Paperback", "Hardcover"], "categories": ["Mathematics", "Computers"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=z9qv32OyEu4C&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=z9qv32OyEu4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "fast", "price": 44}