{"id": "zDCCHUgsvhcC", "title": "War in the Blood", "subtitle": "Sex, Politics and AIDS in Southeast Asia", "authors": ["Chris Beyrer"], "publisher": "Palgrave Macmillan", "publishedDate": "1998-02-15", "description": "This engaging and vivid book investigates the course of the HIV epidemic in seven countries of South East Asia: Thailand, Burma, Cambodia, Laos, Malaysia, Vietnam and China’s Yunnan Province. Emphasising the impact of the cultural and political landscapes of these countries on the progress of the disease, the book is the product of both working and travelling in the area. Not merely a commentary on obfuscating government statistics, the author draws upon his encounters with people dealing with the effects of the epidemic and opponents of the regimes of the countries he describes. The epidemic is seen as being vitally linked to the general condition of human rights in the societies. In the first part of the book the author travels to each country in turn chronicling the different approaches adopted to the epidemic. The second part covers issues involving specific groups at risk - among other topics, women and contraception, prostitution and the traffic in women, HIV and the US military, the Heroin trade, gay sex workers, prisoners, and the work of local activists. The third part of the book looks at policy and the general effect of culture on public health care, stressing the need for local empowerment of populations, and in particular women, to effect social changes that would go hand in hand with improvements in the handling of the HIV epidemic. Both passionate and well-informed, this book is a labour of love that discusses the HIV epidemic while giving an intimate, and ultimately celebratory account of South East Asia and asserting the real possiblity for affirmative action.", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "1856495329"}, {"type": "ISBN_13", "identifier": "9781856495325"}], "pageCount": 246, "printType": ["Paperback", "Hardcover"], "categories": ["Health & Fitness", "Politics"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=zDCCHUgsvhcC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=zDCCHUgsvhcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "fast", "price": 46}