{"id": "zeUWtGJ5TyEC", "title": "Between Technology and Science", "subtitle": "Exploring an Emerging Field", "authors": ["Martin Meyer"], "publisher": "Universal-Publishers", "publishedDate": "2005-02-01", "description": "This dissertation addresses emerging developer communities in a new field of science and technology as well as methods to capture exchange processes between them. It contributes to the discussion about a new mode of knowledge production and a changing division of labour between public research, industry, and government by investigating 'nanotechnology' - an emerging area between science and technology. To explore exchange processes in this field, the study applies various methods. In particular, it uses patent citation analysis. The methodological contribution is a new interpretation of this indicator, which sees patent citations as information flows that point to reciprocal exchange processes and potential overlaps between science and technology. This is in contrast to the received interpretation, which suffers from the application of a framework that was developed in the context of scholarly citation and does not fully appreciate that a patent citation is established by the patent examiner - a party external to the inventive process. Various formats of patent citation analysis describe 'nanotechnology' as a set of instrument-driven scientific fields on their way towards science-related technologies. Even though nanotechnology patents contain more patent citations to the scientific literature than other technical fields, the science and technology systems are relatively autonomous. What links them in the case of nano-science and technology is a common interest in improving techniques of nano-scale measurement and manipulation. Another finding is that both countries and firms exhibit relatively strong path-dependencies. While nanotechnology comprises a key set of technological areas - instrumentation, electronics, and pharmaceuticals/chemicals - nano-scale activities vary considerably from country to country. Also knowledge-building activities of firms follow a strong technological path-dependency. As a result, 'social capital' seems to be confined to chiefly technological or scientific trajectories. Hence, 'social capital' appears not to be very useful in explaining how knowledge is accumulated and integrated at the nano-scale. Given the central role of instrumentation and the mediated nature of exchange between science and technology at the nano- scale, public policies should be directed towards supporting education and infrastructure in the area rather than more 'direct' transfer mechanisms.", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "1581122535"}, {"type": "ISBN_13", "identifier": "9781581122534"}], "pageCount": 400, "printType": ["Audiobook", "Paperback", "Hardcover"], "categories": ["Science", "Science"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=zeUWtGJ5TyEC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=zeUWtGJ5TyEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "normal", "price": 21}