{"id": "zLrKGGxBKjAC", "title": "The Origins of Totalitarianism", "subtitle": null, "authors": ["Hannah Arendt"], "publisher": "Houghton Mifflin Harcourt", "publishedDate": "1973-03-21", "description": "“How could such a book speak so powerfully to our present moment? The short answer is that we, too, live in dark times, even if they are different and perhaps less dark, and “Origins” raises a set of fundamental questions about how tyranny can arise and the dangerous forms of inhumanity to which it can lead.” Jeffrey C. Isaac, The Washington Post Hannah Arendt's definitive work on totalitarianism and an essential component of any study of twentieth-century political history The Origins of Totalitarianism begins with the rise of anti-Semitism in central and western Europe in the 1800s and continues with an examination of European colonial imperialism from 1884 to the outbreak of World War I. Arendt explores the institutions and operations of totalitarian movements, focusing on the two genuine forms of totalitarian government in our time—Nazi Germany and Stalinist Russia—which she adroitly recognizes were two sides of the same coin, rather than opposing philosophies of Right and Left. From this vantage point, she discusses the evolution of classes into masses, the role of propaganda in dealing with the nontotalitarian world, the use of terror, and the nature of isolation and loneliness as preconditions for total domination.", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "0547543158"}, {"type": "ISBN_13", "identifier": "9780547543154"}], "pageCount": 576, "printType": ["Audiobook", "Paperback", "Hardcover"], "categories": ["History", "History"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=zLrKGGxBKjAC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=zLrKGGxBKjAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "fast", "price": 31}