{"id": "ZpQCRndTuIkC", "title": "The Cybernetic Imagination in Science Fiction", "subtitle": null, "authors": ["Patricia S. Warrick"], "publisher": "MIT Press", "publishedDate": "1980-01-01", "description": "In this book, Patricia Warrick examines over 200 short stories and novels written between 1930 and 1977 which portray computers as robots, as \"thinking machines,\" as heroes and villains, gods and demons. The works are discussed according to a unique paradigm that divides them and the fictional worlds they create into closed, open, or isolated systems. Warrick analyzes recurring patterns and images, noting how these change (or fail to change) over time and how they relate to real technological developments. While focusing on a particular genre within science fiction, the book seeks to answer broader literary questions—Should the abundant body of work spawned by the science fiction imagination be taken seriously? Has it climbed up from its humble American beginnings in the pulp magazines? Does it do more than entertain? Has it accomplished the task of mythmaking which literature has traditionally done? And will it ultimately replace the realistic novel as the chief literary form by the end of this century? An aesthetic of complementary perception is defined, and Warrick concludes with a look into the electronic future, a condemnation of the pessimism and poor science she has found in much of post-World War II writing, and a proposal for revitalizing the cybernetic imagination. Among the writers whose work is examined are Brian W. Aldiss, Isaac Asimov, John Brunner, John W. Campbell, Arthur C. Clarke, Michael Crichton, Samuel R. Delany, Lester del Rey, Philip K. Dick, Harlan Ellison, Harry Harrison, Robert Heinlein, James Hogan, Fritz Leiber, Franke Herbert, Fred Hoyle, Stanislaw Lem, Anne McCaffrey, Michael Moorcock, Frederick Pohl, Robert Silverberg, Clifford Simak, Kurt Vonnegut, Jr., and Jack Williamson. The book includes extensive fiction and nonfiction bibliographies and an index.", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "0262730618"}, {"type": "ISBN_13", "identifier": "9780262730617"}], "pageCount": 282, "printType": ["Paperback"], "categories": ["Art", "Science+Fiction"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=ZpQCRndTuIkC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=ZpQCRndTuIkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "fast", "price": 43}