{"id": "0gT1zMLEDloC", "title": "Fundamentals of Natural Computing", "subtitle": "Basic Concepts, Algorithms, and Applications", "authors": ["Leandro Nunes de Castro"], "publisher": "CRC Press", "publishedDate": "2006-06-02", "description": "Natural computing brings together nature and computing to develop new computational tools for problem solving; to synthesize natural patterns and behaviors in computers; and to potentially design novel types of computers. Fundamentals of Natural Computing: Basic Concepts, Algorithms, and Applications presents a wide-ranging survey of novel techniques and important applications of nature-based computing. This book presents theoretical and philosophical discussions, pseudocodes for algorithms, and computing paradigms that illustrate how computational techniques can be used to solve complex problems, simulate nature, explain natural phenomena, and possibly allow the development of new computing technologies. The author features a consistent and approachable, textbook-style format that includes lucid figures, tables, real-world examples, and different types of exercises that complement the concepts while encouraging readers to apply the computational tools in each chapter. Building progressively upon core concepts of nature-inspired techniques, the topics include evolutionary computing, neurocomputing, swarm intelligence, immunocomputing, fractal geometry, artificial life, quantum computing, and DNA computing. Fundamentals of Natural Computing is a self-contained introduction and a practical guide to nature-based computational approaches that will find numerous applications in a variety of growing fields including engineering, computer science, biological modeling, and bioinformatics.", "industryIdentifiers": [{"type": "ISBN_13", "identifier": "9781584886433"}, {"type": "ISBN_10", "identifier": "1584886439"}], "pageCount": 696, "printType": ["Audiobook"], "categories": ["Science", "Computers"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=0gT1zMLEDloC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=0gT1zMLEDloC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "fast", "price": 44}