{"id": "2bgmPlzYn_sC", "title": "Imaging and Imagining the Fetus", "subtitle": "The Development of Obstetric Ultrasound", "authors": ["Malcolm Nicolson", "John E. E. Fleming"], "publisher": "JHU Press", "publishedDate": "2013-01-10", "description": "To its proponents, the ultrasound scanner is a safe, reliable, and indispensable aid to diagnosis. In some U.S. states, an ultrasound scan is now required by legislation before a woman can obtain an abortion, adding a new dimension to an already controversial practice. Imaging and Imagining the Fetus engages both the development of a modern medical technology and the concerted critique of that technology. The authors relate the technical and social history of ultrasound imaging-from early experiments in Glasgow in 1956 through wide deployment in the British hospital system by 1975 to its ubiquitous use in maternity clinics throughout the developed world by the end of the twentieth century. Obstetrician Ian Donald and engineer Tom Brown created ultrasound technology in Glasgow, where their prototypes were based on the industrial flaw detector, an instrument readily available to them in the shipbuilding city. As a physician, Donald supported the use of ultrasound for clinical purposes, and as a devout High Anglican he imbued the images with moral significance. He opposed abortion-decisions about which were increasingly guided by the ultrasound technology he pioneered - and he occasionally used ultrasound images to convince pregnant women not to abort the fetuses they could now see. This book explores why earlier innovators failed where Donald and Brown succeeded. It also shows how ultrasound developed into a black box technology whose users can fully appreciate the images they produce and have no need to understand the technology. These images of the fetus may be produced by machines but they live vividly in the human imagination.", "industryIdentifiers": [{"type": "ISBN_13", "identifier": "9781421407937"}, {"type": "ISBN_10", "identifier": "1421407930"}], "pageCount": 317, "printType": ["Paperback"], "categories": ["Medical", "Politics"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=2bgmPlzYn_sC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=2bgmPlzYn_sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "super fast", "price": 50}