{"id": "2QspR4VZYboC", "title": "Oracle Database Performance and Scalability", "subtitle": "A Quantitative Approach", "authors": ["Henry H. Liu"], "publisher": "John Wiley & Sons", "publishedDate": "2011-11-22", "description": "A data-driven, fact-based, quantitative text on Oracleperformance and scalability With database concepts and theories clearly explained inOracle's context, readers quickly learn how to fully leverageOracle's performance and scalability capabilities at every stage ofdesigning and developing an Oracle-based enterprise application.The book is based on the author's more than ten years of experienceworking with Oracle, and is filled with dependable, tested, andproven performance optimization techniques. Oracle Database Performance and Scalability is dividedinto four parts that enable readers to progressively learn andapply new skills: Part 1, Getting Started with Oracle, describes how to set up aworking Oracle environment, offering a quick tour to illustratemajor database concepts Part 2, Oracle Architecture from Performance and ScalabilityPerspectives, explains all the major database concepts andarchitectural features that readers need to know to optimize Oracleperformance and scalability Part 3, Optimizing Oracle Performance and Scalability, offershands-on instructions to optimize and fine-tune performance andscalability for all database applications Part 4, Case Studies: Oracle Meeting Real-World Performance andScalability Challenges, sets forth quantitative case studies basedon the author's first-hand experience that demonstrate how readerscan apply proven techniques to dramatically improve the performanceand scalability of actual database products In addition to case studies, this book offers a detailed secureonline banking application as an example, making it possible forreaders to fully explore Oracle's performance and scalabilityfeatures on their own. Oracle Database Performance andScalability is an ideal text for pre-conditioning collegestudents and training software developers.", "industryIdentifiers": [{"type": "ISBN_13", "identifier": "9781118056998"}, {"type": "ISBN_10", "identifier": "111805699X"}], "pageCount": 694, "printType": ["Hardcover"], "categories": ["Computers", "Computers"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=2QspR4VZYboC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=2QspR4VZYboC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "super fast", "price": 48}