{"id": "39OlDAEACAAJ", "title": "Cascadia", "subtitle": null, "authors": ["H. W. Buzz Bernard"], "publisher": "Bell Bridge Books", "publishedDate": "2016-07-11", "description": "If you live in the Pacific Northwest, get ready to run for your life . . . In the face of a massive earthquake and tsunami in the Pacific Northwest, a respected geologist must make two gut-wrenching decisions. One could cost him his reputation, the other, his life. Is the Northwest overdue for a huge quake and tsunami, or will the region remain safe for hundreds of years yet to come? No one knows... or does someone? Dr. Rob Elwood, a geologist whose specialty is earthquakes and tsunamis, is having nightmares of \"the big one\" that are way too real to disregard. His friend, a counselor and retired reverend, does not think Rob is going nuts. To the contrary, he believes the dreams are premonitions to be taken seriously. No one else does, however, even after a press conference. Some live to regret it, most don't. Rob's drama becomes intertwined with others-a retired fighter pilot trying to make amends to a woman he jilted decades ago and a quixotic retiree searching for legendary buried treasure in the rugged coastal mountains of Oregon. All are about to live Rob's nightmare. \"Riveting, scary, and entirely believable . . . a compelling, page-turning thriller with the ring of truth.\" Jerry Thompson, author of \"Cascadia's Fault\" H. W. \"Buzz\" Bernard, a native Oregonian born in Eugene and raised in Portland, is a best-selling, award-winning novelist. His debut novel, \"Eyewall,\" which one reviewer called a \"perfect summer beach read,\" was released in May 2011 and went on to become a number-one best seller in Amazon's Kindle Store. Before becoming a novelist, Buzz worked at The Weather Channel in Atlanta, Georgia, as a senior meteorologist for thirteen years. Prior to that, he served as a weather officer in the U.S. Air Force for over three decades. He attained the rank of colonel and his \"airborne\" experiences include a mission with the Air Force Reserve Hurricane Hunters, air drops over the Arctic Ocean and Turkey, and a stint as a weather officer aboard a Tactical Air Command airborne command post (C-135).", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "1611946794"}, {"type": "ISBN_13", "identifier": "9781611946796"}], "pageCount": 226, "printType": ["Paperback"], "categories": ["Fiction", "Thrillers"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=39OlDAEACAAJ&printsec=frontcover&img=1&zoom=5&source=public", "thumbnail": "http://books.google.com/books/content?id=39OlDAEACAAJ&printsec=frontcover&img=1&zoom=1&source=public"}, "language": "en", "deliveryOption": "fast", "price": 22}