{"id": "7bSLaA0cftAC", "title": "A Practical Theory of Programming", "subtitle": null, "authors": ["Eric C.R. Hehner"], "publisher": "Springer Science & Business Media", "publishedDate": "1993-08-06", "description": "There are several theories of programming. The first usable theory, often called \"Hoare's Logic\", is still probably the most widely known. In it, a specification is a pair of predicates: a precondition and postcondition (these and all technical terms will be defined in due course). Another popular and closely related theory by Dijkstra uses the weakest precondition predicate transformer, which is a function from programs and postconditions to preconditions. lones's Vienna Development Method has been used to advantage in some industries; in it, a specification is a pair of predicates (as in Hoare's Logic), but the second predicate is a relation. Temporal Logic is yet another formalism that introduces some special operators and quantifiers to describe some aspects of computation. The theory in this book is simpler than any of those just mentioned. In it, a specification is just a boolean expression. Refinement is just ordinary implication. This theory is also more general than those just mentioned, applying to both terminating and nonterminating computation, to both sequential and parallel computation, to both stand-alone and interactive computation. And it includes time bounds, both for algorithm classification and for tightly constrained real-time applications.", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "0387941061"}, {"type": "ISBN_13", "identifier": "9780387941066"}], "pageCount": 247, "printType": ["Paperback"], "categories": ["Computers", "Computers"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=7bSLaA0cftAC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=7bSLaA0cftAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "fast", "price": 19}