{"id": "7RQ9vgAACAAJ", "title": "My Sister's Bones", "subtitle": null, "authors": ["Nuala Ellwood"], "publisher": "Viking", "publishedDate": "2017-01-30", "description": "'This formidable debut thriller rivals THE GIRL ON THE TRAIN as a compulsive read' Observer THE PSYCHO-THRILLER REVIEWERS ARE CALLING 'SHOCKING' 'RIVETING' AND 'EXPLOSIVE' Kate Rafter is a high-flying war reporter. She's the strong one. The one who escaped Herne Bay and their father. Her sister Sally didn't. Instead, she drinks. But when their mother dies, Kate is forced to return to the old family home. And on her first night she is woken by a terrifying scream. What secret has Kate stumbled upon? And is she strong enough to uncover the truth . . . and make it out alive? 'Memorable, jaw-dropping ... harrowing fiction that skilfully draws parallels between the effects of civil war and domestic violence' Sunday Times 'Well-written ... an elegant, punchy thriller with a dark heart' Observer Thriller of the Month 'An exciting, shocking, fast-paced read ... a clever, compelling tale full of surprises' Daily Express 'For lovers of The Girl on the Train ...a tense story with multiple twists and turns' Prima 'Compelling ... Brimful of tension, twists and darkness, this one grabbed me on the first page and didn't let go' Woman and Home 'Compelling and intriguing, right from the very first page' Sharon Bolton 'A gripping rollercoaster ride of a thriller' Christobel Kent, author of The Loving Husband 'Twists and turns until the last page' Tammy Cohen 'A stunning book. Compelling, unsettling and powerful this is a book that will stay with me for a long time.' C. L. Taylor 'Nuala Ellwood has created a tale that is gripping, engrossing and surprising at every turn. I loved it' Rowan Coleman 'An accomplished and page-turning thriller. It twists and turns in so many directions it's impossible to guess where it's going next' Nicholas Searle, author of The Good Liar 'Loved I Let You Go and Behind Closed Doors? My Sister's Bones is guaranteed to be this year's most twisty and twisted read - you'll never see what's coming!' Ava Marsh, author of Untouchable 'Ellwood's protagonist Kate is a female hero in the best sense, flawed but brave' Helen Callaghan, author of Dear Amy 'My Sister's Bones is a tense, atmospheric, deliciously dark story' Amanda Jennings, author of In Her Wake 'A twisty psychological thriller. I raced through it in one sitting!' Lucy Atkins, author of The Other Child 'This book is amazing - harrowing and compelling' Luana Lewis", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "0241978157"}, {"type": "ISBN_13", "identifier": "9780241978153"}], "pageCount": 400, "printType": ["Audiobook", "Hardcover"], "categories": ["Thrillers"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=7RQ9vgAACAAJ&printsec=frontcover&img=1&zoom=5&source=public", "thumbnail": "http://books.google.com/books/content?id=7RQ9vgAACAAJ&printsec=frontcover&img=1&zoom=1&source=public"}, "language": "en", "deliveryOption": "super fast", "price": 17}