{"id": "_XgLAgAAQBAJ", "title": "Abundancia", "subtitle": "El futuro es mejor de lo que piensas", "authors": ["Peter Diamandis", "Steven Kotler"], "publisher": "Antoni Bosch editor", "publishedDate": "2013-11-13", "description": "Desde los orígenes de la humanidad, unos pocos privilegiados han vivido en marcado contraste con la mayoría, muy pobre. La opinión más común es que la distancia que separa a unos de otros es imposible de superar. Sin embargo la distancia se está estrechando...y rápido. En Abundancia, el empresario del espacio convertido en pionero de la innovación, Peter H. Diamandis y el galardonado escritor de temas científicos Steven Kotler documentan cómo el progreso en inteligencia artificial, robótica, computación infinita, redes de banda ancha, manufactura digital, nanomateriales, biología sintética y muchas otras tecnologías que están creciendo exponencialmente nos permitirán obtener en las próximas dos décadas unos avances muy superiores a los que hemos conseguido en los doscientos años anteriores. Pronto tendremos la capacidad de alcanzar y superar las necesidades básicas de cada hombre, mujer y niño del planeta. La abundancia para todos está a nuestro alcance. En este apasionante antídoto contra el pesimismo imperante, los autores exploran cómo cuatro fuerzas emergentes -las tecnologías exponenciales, el innovador \"hazlo tú mismo\", los tecnofilántropos y los mil millones emergentes- están conspirando para resolver nuestros mayores problemas.", "industryIdentifiers": [{"type": "ISBN_13", "identifier": "9788495348920"}, {"type": "ISBN_10", "identifier": "8495348926"}], "pageCount": 488, "printType": ["Audiobook", "Paperback", "Hardcover"], "categories": ["Social Science", "Technology"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=_XgLAgAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=_XgLAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "es", "deliveryOption": "normal", "price": 39}