{"id": "aAnSBwAAQBAJ", "title": "Protocols for High-Speed Networks VI", "subtitle": "IFIP TC6 WG6.1 & WG6.4 / IEEE ComSoc TC on Gigabit Networking Sixth International Workshop on Protocols for High-Speed Networks (PfHSN ’99) August 25–27, 1999, Salem, Massachusetts, USA", "authors": ["Joseph Touch", "James P.G. Sterbenz"], "publisher": "Springer", "publishedDate": "2013-03-14", "description": "1 This year marks the l0 h anniversary of the IFIP International Workshop on Protocols for High-Speed Networks (PfHSN). It began in May 1989, on a hillside overlooking Lake Zurich in Switzerland, and arrives now in Salem Massachusetts 6,000 kilometers away and 10 years later, in its sixth incarnation, but still with a waterfront view (the Atlantic Ocean). In between, it has visited some picturesque views of other lakes and bays of the world: Palo Alto (1990 - San Francisco Bay), Stockholm (1993 - Baltic Sea), Vancouver (1994- the Strait of Georgia and the Pacific Ocean), and Sophia Antipolis I Nice (1996- the Mediterranean Sea). PfHSN is a workshop providing an international forum for the exchange of information on high-speed networks. It is a relatively small workshop, limited to 80 participants or less, to encourage lively discussion and the active participation of all attendees. A significant component of the workshop is interactive in nature, with a long history of significant time reserved for discussions. This was enhanced in 1996 by Christophe Diot and W allid Dabbous with the institution of Working Sessions chaired by an \"animator,\" who is a distinguished researcher focusing on topical issues of the day. These sessions are an audience participation event, and are one of the things that makes PfHSN a true \"working conference.", "industryIdentifiers": [{"type": "ISBN_13", "identifier": "9780387355801"}, {"type": "ISBN_10", "identifier": "0387355804"}], "pageCount": 282, "printType": ["Audiobook", "Paperback"], "categories": ["Computers", "Computers"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=aAnSBwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=aAnSBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "fast", "price": 16}