{"id": "C37ADAAAQBAJ", "title": "Information Technology Law", "subtitle": "The Law and Society", "authors": ["Andrew Murray"], "publisher": "Oxford University Press", "publishedDate": "2016-07-07", "description": "Information Technology Law is the ideal companion for a course of study on IT law and the ways in which it is evolving in response to rapid technological and social change. The third edition of this ground-breaking textbook develops its unique examination of the legal processes and their relationship to the modern \"information society\". Charting the development of the rapid digitization of society and its impact on established legal principles, Murray examines thechallenges faced with enthusiasm and clarity. Following a clearly-defined part structure, the text begins by defining the information society and discussing how it may be regulated, before moving on to explore issues of internet governance, privacy and surveillance, intellectual property and rights,and commerce within the digital sphere. Comprehensive and engaging, Information Technology Law takes an original and thought-provoking approach to examining this fast-moving area of law in context. Online Resource Centre: The third edition is supported by a range of online resources, including:* Additional chapters on the Digital Sphere and Virtual Environments* Audio podcasts suitable for revision* Updates to the law post-publication* A flashcard glossary of key terms and concepts* Outline answers to end of chapter questions* A link to the author's blog, The IT Lawyer* Web links", "industryIdentifiers": [{"type": "ISBN_13", "identifier": "9780198732464"}, {"type": "ISBN_10", "identifier": "0198732465"}], "pageCount": 696, "printType": ["Paperback"], "categories": ["Internet"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=C37ADAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=C37ADAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "fast", "price": 50}