{"id": "dB8xxdBqG_EC", "title": "CCENT/CCNA ICND1 640-822 Official Cert Guide", "subtitle": null, "authors": ["Wendell Odom"], "publisher": "Cisco Press", "publishedDate": "2011-10-11", "description": "A brand new edition of the number one book on the CCENT/CCNA ICND1 exam! * *This new edition has been fully updated to refresh the content, add new exercises, and enhance certain essential CCENT and CCNA exam topics. *The CD offers a brand new practice exam engine, offering a wealth of customization options and reporting features along with several hundred exam-realistic practice questions. *The CD also contains a free network simulator with new exercises. This new edition has been fully updated to refresh the content, add new exercises, and enhance certain essential CCENT and CCNA exam topics. The previous single chapter on IP Addressing and Subnetting has been completely rewritten, to make the concepts easier to understand and absorb. A significant amount of new practice exercises have been added to help master this complex and important topic. These new exercises will help you not only master the concepts but also help improve your subnet calculation speed, which is a critical factor for success on the exam. In addition to these changes, the TCP/IP and OSI Networking Models and Fundamentals of LANs chapters were also completely updated and rewritten. The Numeric Reference Table appendix was also completely revised. In addition to the wealth of updated content, this new edition also includes a series of free hands-on exercises to help master several real-world configuration activities. These exercises can be performed on the CCNA Network Simulator, ICND1 Lite Edition included for free on the CD-ROM. Finally, the practice test has been fully updated to the new Pearson IT Certification Practice Test software, offering a wealth of customization options and reporting features along with several hundred exam-realistic practice questions.", "industryIdentifiers": [{"type": "ISBN_13", "identifier": "9781587204258"}, {"type": "ISBN_10", "identifier": "1587204258"}], "pageCount": 736, "printType": ["Paperback", "Hardcover"], "categories": ["Computers", "Technology"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=dB8xxdBqG_EC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=dB8xxdBqG_EC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "super fast", "price": 20}