{"id": "DUqsOKgGoJUC", "title": "Sport Worlds", "subtitle": "A Sociological Perspective", "authors": ["Joseph A. Maguire"], "publisher": "Human Kinetics", "publishedDate": "2002-01", "description": "Sport Worlds: A Sociological Perspectivetakes a novel approach to tracing the intimate and extensive relationships between sport and other social worlds. By examining classic issues and current trends, the text offers students and practitioners alike a broad base of knowledge with which to challenge the everyday conventions and practices of sport. Joseph Maguire, Grant Jarvie, Louise Mansfield, and Joe Bradley deftly highlight the ways in which sport competitions are shaped more by what happens off the field than on. Using contemporary examples, the authors paint a historically relevant picture of how sport is an integral part of the global order, our local communities, and our individual identities. The text includes the following features: -A straightforward organization and easy-to-read style making it an essential reference for students and professionals studying sociology of sport -Clearly stated objectives and review questions at the start and end of each chapter that give readers a framework for learning and understanding key points throughout the text -Project suggestions in each chapter that allow readers to incorporate learning concepts into hands-on, real-life situations, furthering student comprehension -Narrative case studies based on current issues illustrating the global nature of the modern world of sport -Highlighted examples that allow readers to relate today's sport headlines to issues and trends beyond the final score -Debating points that engage readers in thought-provoking discussions, allowing readers to assess the sociology of sport issues for themselves Part I,\"Sport Inside the World,\" examines a range of global systems, processes, and issues that characterize sport worlds. These include networks, boundaries, conventions, and challenges. Attention is given to issues such as migration, the environment, and politics. Part II,“Inside the Worlds of Sport,” focuses on the significance of sport in the emotional and social lives of people. Special focus is on questions of gender, place, space, and identities. Sport Worlds: A Sociological Perspectivekeenly illustrates how sport enters our lives from different paths, giving readers a fresh perspective from which to consider the true character and meaning of sport. For students, researchers, and professionals alike—be they participants, spectators, or consumers of sport—the text is an extensive resource that will enhance their overall experience in the world of sport.", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "0880119721"}, {"type": "ISBN_13", "identifier": "9780880119726"}], "pageCount": 242, "printType": ["Audiobook", "Paperback"], "categories": ["Education", "Sports"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=DUqsOKgGoJUC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=DUqsOKgGoJUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "super fast", "price": 43}