{"id": "fKdkQgAACAAJ", "title": "Sexy Thrills", "subtitle": "Undressing the Erotic Thriller", "authors": ["Nina K. Martin"], "publisher": null, "publishedDate": "2007", "description": "How erotic thrillers impact contemporary ideas about feminism and femininity Unlike the bulk of soft-core pornography, direct-to-video erotic thriller films are made specifically to appeal to women. Nina K. Martin argues that this makes them a valuable resource for investigating female sexuality, subjectivity, and gender construction, and her Sexy Thrills is the first study to use them to examine the construction of female desire. The heroines of these productions have overtly sexual adventures, often dabbling in a variety of sex work positions--including call girl, stripper, and exotic dancer--to get in touch with their sexual desires. Martin explains, however, that the films highlight a fundamental tension between endorsing an empowered, sexually experienced female heroine (\"the sexy bad girl\") and reinforcing more conventional, constructed standards that limit the acceptable forms of feminine sexuality. So while the sexual explicitness of the films acknowledges the increasing appeal of pornography to female heterosexual viewers, erotic thrillers remain couched in romanticized narratives and settings that speak to very traditional understandings of femininity and desire. By analyzing the way the specifics of this hybrid genre have been shaped by pop cultural products targeting women, including soap operas, women's magazines, and talk shows, Sexy Thrills unpacks the construction of female desire to reveal how sex is marketed to heterosexual women.", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "0252074378"}, {"type": "ISBN_13", "identifier": "9780252074370"}], "pageCount": 206, "printType": ["Audiobook", "Hardcover"], "categories": ["Performing Arts", "Thrillers"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=fKdkQgAACAAJ&printsec=frontcover&img=1&zoom=5&source=public", "thumbnail": "http://books.google.com/books/content?id=fKdkQgAACAAJ&printsec=frontcover&img=1&zoom=1&source=public"}, "language": "en", "deliveryOption": "fast", "price": 26}