{"id": "GTIlDwAAQBAJ", "title": "A History of Technology and Environment", "subtitle": "From Stone Tools to Ecological Crisis", "authors": ["Edward L. Golding"], "publisher": "Taylor & Francis", "publishedDate": "2016-12-08", "description": "This book provides an accessible overview of the ways that key areas of technology have impacted global ecosystems and natural communities. It offers a new way of thinking about the overall origins of environmental problems. Combining approaches drawn from environmental biology and the history of science and technology, it describes the motivations behind many technical advances and the settings in which they occurred, before tracing their ultimate environmental impacts. Four broad areas of human activity are described: over-harvesting of natural resources using the examples of hunting, fishing and freshwater use; farming, population, land use, and migration; discovery, synthesis and use of manufactured chemicals; and development of sources of artificial energy and the widespread pollution caused by power generation and energy use. These innovations have been driven by various forces, but in most cases new technologies have emerged out of fascinating, psychologically rich, human experiences. This book provides an introduction to these complex developments and will be essential reading for students of science, technology and society, environmental history, and the history of science and technology.", "industryIdentifiers": [{"type": "ISBN_13", "identifier": "9781134867745"}, {"type": "ISBN_10", "identifier": "1134867743"}], "pageCount": 282, "printType": ["Paperback", "Hardcover"], "categories": ["Business & Economics", "Technology"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=GTIlDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=GTIlDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "normal", "price": 43}