{"id": "gzgqcXEa308C", "title": "The American Census", "subtitle": "A Social History", "authors": ["Margo J. Anderson"], "publisher": "Yale University Press", "publishedDate": "1990", "description": "This book, published on the eve of the bicentennial of the American census, is the first social history of this remarkably important institution, from its origins in 1790 to the present. Margo Anderson argues that the census has always been an influential policymaking tool, used not only to determine the number of representatives apportioned to each state but also to allocate tax dollars to states, and, in the past, to define groups-such as slaves and immigrants-who were to be excluded from the American polity. As a history of the census, this study is a delight. It is thoroughly researched and richly detailed. Anderson is to be commended for covering such an expansive chronology with such skill...Anderson has woven together not only social history but also intellectual, institutional, political, and military history into a thoroughly readable book that examines not only changes in the census but also the remarkable changes that have taken place in the US.-Choice This book is valuable, clearly written and contains many interesting facts. It should be read not only by national policymakers and the statistical community, but by all who are interested in American society.-Bryant Robey, Population Today A solid and readable piece of social, political, and institutional history. It will be essential reading not only for historians of American politics but also for census and population experts, for any public policy formulators who rely on census figures, and for those interested in the history of numeracy and statistics.-Patricia Cline Cohen, University of California, Santa Barbara", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "0300047096"}, {"type": "ISBN_13", "identifier": "9780300047097"}], "pageCount": 257, "printType": ["Audiobook", "Paperback", "Hardcover"], "categories": ["History", "History"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=gzgqcXEa308C&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=gzgqcXEa308C&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "normal", "price": 25}