{"id": "HhSON0xOCQ0C", "title": "Harness the Power of Big Data The IBM Big Data Platform", "subtitle": null, "authors": ["Paul Zikopoulos", "Dirk deRoos", "Krishnan Parasuraman", "Thomas Deutsch", "James Giles", "David Corrigan"], "publisher": "McGraw Hill Professional", "publishedDate": "2012-11-08", "description": "Boost your Big Data IQ! Gain insight into how to govern and consume IBM’s unique in-motion and at-rest Big Data analytic capabilities Big Data represents a new era of computing—an inflection point of opportunity where data in any format may be explored and utilized for breakthrough insights—whether that data is in-place, in-motion, or at-rest. IBM is uniquely positioned to help clients navigate this transformation. This book reveals how IBM is infusing open source Big Data technologies with IBM innovation that manifest in a platform capable of \"changing the game.\" The four defining characteristics of Big Data—volume, variety, velocity, and veracity—are discussed. You’ll understand how IBM is fully committed to Hadoop and integrating it into the enterprise. Hear about how organizations are taking inventories of their existing Big Data assets, with search capabilities that help organizations discover what they could already know, and extend their reach into new data territories for unprecedented model accuracy and discovery. In this book you will also learn not just about the technologies that make up the IBM Big Data platform, but when to leverage its purpose-built engines for analytics on data in-motion and data at-rest. And you’ll gain an understanding of how and when to govern Big Data, and how IBM’s industry-leading InfoSphere integration and governance portfolio helps you understand, govern, and effectively utilize Big Data. Industry use cases are also included in this practical guide.", "industryIdentifiers": [{"type": "ISBN_13", "identifier": "9780071808187"}, {"type": "ISBN_10", "identifier": "0071808183"}], "pageCount": 280, "printType": ["Paperback", "Hardcover"], "categories": ["Computers", "Computers"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=HhSON0xOCQ0C&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=HhSON0xOCQ0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "super fast", "price": 15}