{"id": "MzXpbyPRVYoC", "title": "Beyond Representation", "subtitle": "Television Drama and the Politics and Aesthetics of Identity", "authors": ["Geraldine Harris"], "publisher": "Manchester University Press", "publishedDate": "2006", "description": "Beyond representation poses the question as to whether over the last thirty years there have been signs of 'progress' or 'progressiveness' in the representation of 'marginalised' or subaltern identity categories within television drama in Britain and the US. In doing so it interrogates some of the key assumptions concerning the relationship between aesthetics and the politics of identity that have influenced and informed television drama criticism during this period. This book can function as a textbook because it provides students with a clear and coherent pathway through complex, wide-reaching and highly influential interdisciplinary terrain. Yet its rigorous and incisive re-evaluation of some of the key concepts that dominated academic thought in the twentieth century also make it of interest to scholars and specialists. Chapters examine ideas around politics and aesthetics emerging from Marxist-socialism and postmodernism, feminism and postmodern feminism, anti-racism and postcolonialism, queer theory and theories of globalisation, so as to evaluates their impact on television criticism and on television as an institution. These discussions are consolidated through case studies that offer analyses of a range of television drama texts including Big Women, Ally McBeal, Supply and Demand, The Bill, Second Generation, Star Trek (Enterprise), Queer as Folk, Metrosexuality and The Murder of Stephen Lawrence. This book is aimed at students and scholars of Television Drama, Media and Communication, Cultural Studies, Women's Studies and those concerned with questions of politics and aesthetics in other disciplines.", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "1847791727"}, {"type": "ISBN_13", "identifier": "9781847791726"}], "pageCount": 221, "printType": ["Audiobook", "Paperback"], "categories": ["PERFORMING ARTS", "Politics"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=MzXpbyPRVYoC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=MzXpbyPRVYoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "fast", "price": 36}