{"id": "nHEGJY9soYMC", "title": "Did Darwin Write the Origin Backwards?", "subtitle": "Philosophical Essays on Darwin's Theory", "authors": ["Elliott Sober"], "publisher": "Prometheus Books", "publishedDate": "2011-03-31", "description": "Is it accurate to label Darwin’s theory \"the theory of evolution by natural selection,\" given that the concept of common ancestry is at least as central to Darwin’s theory? Did Darwin reject the idea that group selection causes characteristics to evolve that are good for the group though bad for the individual? How does Darwin’s discussion of God in The Origin of Species square with the common view that he is the champion of methodological naturalism? These are just some of the intriguing questions raised in this volume of interconnected philosophical essays on Darwin. The author's approach is informed by modern issues in evolutionary biology, but is sensitive to the ways in which Darwin’s outlook differed from that of many biologists today. The main topics that are the focus of the book—common ancestry, group selection, sex ratio, and naturalism—have rarely been discussed in their connection with Darwin in such penetrating detail. Author Professor Sober is the 2008 winner of the Prometheus Prize. This biennial award, established in 2006 through the American Philosophical Association, is designed \"to honor a distinguished philosopher in recognition of his or her lifetime contribution to expanding the frontiers of research in philosophy and science.\" This insightful collection of essays will be of interest to philosophers, biologists, and laypersons seeking a deeper understanding of one of the most influential scientific theories ever propounded. From the Trade Paperback edition.", "industryIdentifiers": [{"type": "ISBN_13", "identifier": "9781616142780"}, {"type": "ISBN_10", "identifier": "1616142782"}], "pageCount": 230, "printType": ["Audiobook", "Paperback", "Hardcover"], "categories": ["Philosophy", "Science"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=nHEGJY9soYMC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=nHEGJY9soYMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "fast", "price": 18}