{"id": "nZkt02wl6egC", "title": "Computational Analysis of Randomness in Structural Mechanics", "subtitle": "Structures and Infrastructures Book Series", "authors": ["Christian Bucher"], "publisher": "CRC Press", "publishedDate": "2009-03-30", "description": "Proper treatment of structural behavior under severe loading - such as the performance of a high-rise building during an earthquake - relies heavily on the use of probability-based analysis and decision-making tools. Proper application of these tools is significantly enhanced by a thorough understanding of the underlying theoretical and computational concepts as provided by this book. Detailing the computational aspects of stochastic analysis within the field of structural mechanics, this book first presents a few motivating examples that demonstrate the various random effects within the context of simple structural analysis models. It moreover briefly reviews the fundamental concepts from continuum mechanics and puts them in the perspective of modern numerical tools, such as the finite element method. More advanced topics are developed step by step while gradually increasing the complexity of the structural and probabilistic analyses. This volume is intended for structural analysts and advanced students who wish to explore the benefits of stochastic analysis. It will provide researchers and decision makers working on structural and infrastructural systems with the necessary probabilistic information needed for strategic developments in construction, inspection and maintenance.", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "0203876539"}, {"type": "ISBN_13", "identifier": "9780203876534"}], "pageCount": 248, "printType": ["Audiobook", "Hardcover"], "categories": ["Mathematics", "Computers"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=nZkt02wl6egC&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=nZkt02wl6egC&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "super fast", "price": 22}