{"id": "wvKbCgAAQBAJ", "title": "The Smart Girl's Guide to Privacy", "subtitle": "Practical Tips for Staying Safe Online", "authors": ["Violet Blue"], "publisher": "No Starch Press", "publishedDate": "2015", "description": "“An illuminating handbook for women.” —ELLE Magazine “The Smart Girl's Guide to Privacy is a straight-forward how-to for protecting your privacy and undermining the social media settings that want you to share potentially intimate details with the world...I found the book alarmingly handy.” —Bitch Magazine “For girls and women in the technological age, this guide to Internet safety is a must-read. It’s a young woman’s invaluable guide to empowerment, addressing not only the why of keeping strong boundaries but the how.” —Foreword Reviews The whirlwind of social media, online dating, and mobile apps can make life a dream—or a nightmare. For every trustworthy website, there are countless jerks, bullies, and scam artists who want to harvest your personal information for their own purposes. But you can fight back, right now. In The Smart Girl’s Guide to Privacy, award-winning author and investigative journalist Violet Blue shows you how women are targeted online and how to keep yourself safe. Blue’s practical, user-friendly advice will teach you how to: -Delete personal content from websites -Use website and browser privacy controls effectively -Recover from and prevent identity theft -Figure out where the law protects you—and where it doesn’t -Set up safe online profiles -Remove yourself from people-finder websites Even if your privacy has already been compromised, don’t panic. It’s not too late to take control. Let The Smart Girl’s Guide to Privacy help you cut through the confusion and start protecting your online life.", "industryIdentifiers": [{"type": "ISBN_13", "identifier": "9781593276485"}, {"type": "ISBN_10", "identifier": "1593276486"}], "pageCount": 176, "printType": ["Hardcover"], "categories": ["Computers", "Internet"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=wvKbCgAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=wvKbCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "fast", "price": 28}