{"id": "xifgAQAACAAJ", "title": "Costa Maldita /Crimson Shore", "subtitle": null, "authors": ["Douglas Preston", "Lincoln Child"], "publisher": "Agent Pendergast", "publishedDate": "2017-08-29", "description": "En la decimoquinta entrega de la serie protagonizada por el agente especial Pendergast, una terrible amenaza acecha bajo la aparente tranquilidad de una poblacion costera cercana a Salem. El agente especial Pendergast acepta una investigacion privada en Exmouth, localidad costera cercana a Salem. Tiene que resolver el robo de una valiosa coleccion de vinos propiedad del escultor Percival Lake y de su companera Carole. Para ello viaja al lugar de los hechos acompanado de su ayudante Constance Greene. En la pared de la bodega de la casa, antigua residencia del farero, descubre un nicho con restos humanos muy antiguos. Lake comenta en ese momento que la proximidad de Salem, mas la numerosa poblacion de mosquitos chupasangre en las marismas que rodean Exmouth, han provocado gran cantidad de leyendas y rumores referidos al pueblo. Entonces el cuerpo de una persona asesinada aparece en las marismas. La unica pista es una serie deesculturas misteriosas. Podrian tener estos simbolos demoniacos alguna relacion con la colonia de brujas que vivian en las inmediaciones hace tiempo? Puede que Constance sea la unica que de verdad comprenda el peligro que tanto ella como Pendergast y los habitantes de Exmouth estan a punto de afrontar... Resena: Pendergast es un heroe peculiar, un Sherlock Holmes moderno. Kirkus Reviews ENGLISH DESCRIPTIONA secret chamber. A mysterious shipwreck. A murder in the desolate salt marshes. A seemingly straightforward private case turns out to be much more complicated-and sinister-than Special Agent A.X.L. Pendergast ever could have anticipated. Pendergast, together with his ward Constance Greene, travels to the quaint seaside village of Exmouth, Massachusetts, to investigate the theft of a priceless wine collection. But inside the wine cellar, they find something considerably more disturbing: a bricked-up niche that once held a crumbling skeleton. Pendergast and Constance soon learn that Exmouth is a town with a very dark and troubled history, and this skeleton may be only the first hint of an ancient transgression, kept secret all these years. But they will discover that the sins of the past are still very much alive. Local legend holds that during the 1692 witch trials in Salem, the real witches escaped, fleeing north to Exmouth and settling deep in the surrounding salt marshes, where they continued to practice their wicked arts. Then, a murdered corpse turns up in the marshes. The only clue is a series of mysterious carvings. Could these demonic symbols bear some relation to the ancient witches' colony, long believed to be abandoned? A terrible evil lurks beneath the surface of this sleepy seaside town-one with deep roots in Exmouth's grim history. And it may be that Constance, with her own troubled past, is the only one who truly comprehends the awful danger that she, Pendergast, and the residents of Exmouth must face . . .", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "8401017068"}, {"type": "ISBN_13", "identifier": "9788401017063"}], "pageCount": 368, "printType": ["Audiobook", "Hardcover"], "categories": ["Fiction", "Thrillers"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=xifgAQAACAAJ&printsec=frontcover&img=1&zoom=5&source=public", "thumbnail": "http://books.google.com/books/content?id=xifgAQAACAAJ&printsec=frontcover&img=1&zoom=1&source=public"}, "language": "es", "deliveryOption": "normal", "price": 23}