{"id": "XJHVjH2hz50C", "title": "Conversations with Ursula K. Le Guin", "subtitle": null, "authors": ["Carl Howard Freedman"], "publisher": "Univ. Press of Mississippi", "publishedDate": "2008", "description": "Conversations with Ursula K. Le Guin assembles interviews with the renowned science-fiction and fantasy author of The Left Hand of Darkness, The Dispossessed, The Lathe of Heaven, and the Earthsea sequence of novels and stories. For nearly five decades, Le Guin (b. 1929) has enjoyed immense success--both critical and popular--in science fiction and fantasy. But she has also published well-received works in such genres as realistic fiction, poetry, children's literature, criticism, and translation. In the pieces collected here, Le Guin takes every interview not as an opportunity to recapitulate long-held views but as an occasion for in-depth intellectual discourse. In interviews spanning over twenty-five years of her literary career, including a previously unpublished piece conducted by the volume's editor, Le Guin talks about such diverse subjects as U.S. foreign policy, the history of architecture, the place of women and feminist consciousness in American literature, and the differences between science fiction and fantasy. Carl Freedman is professor of English at Louisiana State University and is the author of Critical Theory and Science Fiction; The Incomplete Projects: Marxism, Modernity, and the Politics of Culture; and George Orwell: A Study in Ideology and Literary Form.", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "1604730943"}, {"type": "ISBN_13", "identifier": "9781604730944"}], "pageCount": 182, "printType": ["Paperback"], "categories": ["Biography & Autobiography", "Science+Fiction"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=XJHVjH2hz50C&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=XJHVjH2hz50C&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "super fast", "price": 45}