{"id": "YTmwk8hMss0C", "title": "Interdisciplinarity in Technology Assessment", "subtitle": "Implementation and Its Chances and Limits", "authors": ["M. Decker"], "publisher": "Springer Science & Business Media", "publishedDate": "2001", "description": "Technology Assessment processes can be taken as a paradigm for interdisciplinary research. It is expected that interdisciplinary Technology Assessment is able to find solutions for actual sociopolitical problems that go beyond those expectable from one individual scientific discipline alone. The common notion that for tasks like this different disciplinary perspectives should be brought together confronts the fact that there is no common notion on how interdisciplinary research should be done. In the present volume of the series \"Wissenschaftsethik und Technikfolgenbeurteilung\" European experts of Technology Assessment present their perspectives on interdisciplinary research. They focus on methodology, policy consulting, and participation of stakeholders, laypersons and citizens or present concrete case studies concerning climate change and health care. Each contribution is commented by an other scientist. The result is a discussion-like examination of the connection between interdisciplinarity and the main subjects of Technology Assessment. This makes the book worth reading not only for experts in interdisciplinary research and policy consulting, but also for those who are interested in the ongoing discussion about methodology in European Technology Assessment.", "industryIdentifiers": [{"type": "ISBN_10", "identifier": "3540427929"}, {"type": "ISBN_13", "identifier": "9783540427926"}], "pageCount": 215, "printType": ["Audiobook", "Paperback"], "categories": ["Business & Economics", "Science"], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=YTmwk8hMss0C&printsec=frontcover&img=1&zoom=5&edge=curl&source=public", "thumbnail": "http://books.google.com/books/content?id=YTmwk8hMss0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=public"}, "language": "en", "deliveryOption": "super fast", "price": 29}